{"cards": [{"word": "abase", "sense": 1, "pos": "v.", "definition": "to humiliate, degrade", "example": "After being overthrown and abased, the deposed leader offered to bow down to his conqueror."}, {"word": "abate", "sense": 1, "pos": "v.", "definition": "to reduce, lessen", "example": "The rain poured down for a while, then abated."}, {"word": "abdicate", "sense": 1, "pos": "v.", "definition": "to give up a position, usually one of leadership", "example": "When he realized that the revolutionaries would surely win, the king abdicated his throne."}, {"word": "abduct", "sense": 1, "pos": "v.", "definition": "to kidnap, take by force", "example": "The evildoers abducted the fairy princess from her happy home."}, {"word": "aberration", "sense": 1, "pos": "n.", "definition": "something that differs from the norm", "example": "In 1918, the Boston Red Sox won the World Series, but the success turned out to be an aberration, and the Red Sox have not won a World Series since."}, {"word": "abet", "sense": 1, "pos": "v.", "definition": "to aid, help, encourage (The spy succeeded only because he had a friend on the inside to abet him.) yralubacoV TAS", "example": ""}, {"word": "abhor", "sense": 1, "pos": "v.", "definition": "to hate, detest", "example": "Because he always wound up kicking himself in the head when he tried to play soccer, Oswald began to abhor the sport."}, {"word": "abide", "sense": 1, "pos": "v.", "definition": "to put up with", "example": "Though he did not agree with the decision, Chuck decided to abide by it."}, {"word": "abide", "sense": 2, "pos": "v.", "definition": "to remain", "example": "Despite the beating they’ve taken from the weather throughout the millennia, the mountains abide."}, {"word": "abject", "sense": 1, "pos": "adj.", "definition": "wretched, pitiful", "example": "After losing all her money, falling into a puddle, and breaking her ankle, Eloise was abject."}, {"word": "abjure", "sense": 1, "pos": "v.", "definition": "to reject, renounce", "example": "To prove his honesty, the President abjured the evil policies of his wicked predecessor."}, {"word": "abnegation", "sense": 1, "pos": "n.", "definition": "denial of comfort to oneself", "example": "The holy man slept on the floor, took only cold showers, and generally followed other practices of abnegation."}, {"word": "abort", "sense": 1, "pos": "v.", "definition": "to give up on a half-finished project or effort", "example": "After they ran out of food, the men, attempting to jump rope around the world, had to abort and go home."}, {"word": "abridge", "sense": 1, "pos": "v.", "definition": "to cut down, shorten", "example": "The publisher thought the dictionary was too long and abridged it."}, {"word": "abridge", "sense": 2, "pos": "adj.", "definition": "shortened", "example": "Moby-Dick is such a long book that even the abridged version is longer than most normal books."}, {"word": "abrogate", "sense": 1, "pos": "v.", "definition": "to abolish, usually by authority", "example": "The Bill of Rights assures that the government cannot abrogate our right to a free press."}, {"word": "abscond", "sense": 1, "pos": "v.", "definition": "to sneak away and hide", "example": "In the confusion, the super-spy absconded into the night with the secret plans."}, {"word": "absolution", "sense": 1, "pos": "n.", "definition": "freedom from blame, guilt, sin", "example": "Once all the facts were known, the jury gave Angela absolution by giving a verdict of not guilty."}, {"word": "abstain", "sense": 1, "pos": "v.", "definition": "to freely choose not to commit an action", "example": "Everyone demanded that Angus put on the kilt, but he did not want to do it and abstained."}, {"word": "abstruse", "sense": 1, "pos": "adj.", "definition": "hard to comprehend", "example": "Everyone else in the class understood geometry easily, but John found the subject abstruse."}, {"word": "accede", "sense": 1, "pos": "v.", "definition": "to agree", "example": "When the class asked the teacher whether they could play baseball instead of learn grammar they expected him to refuse, but instead he acceded to their request."}, {"word": "accentuate", "sense": 1, "pos": "v.", "definition": "to stress, highlight (Psychologists agree that those people who are happiest accentuate the positive in life.) SAT Vocabulary", "example": ""}, {"word": "accessible", "sense": 1, "pos": "adj.", "definition": "obtainable, reachable", "example": "After studying with SparkNotes and getting a great score on the SAT, Marlena happily realized that her goal of getting into an Ivy-League college was accessible."}, {"word": "acclaim", "sense": 1, "pos": "n.", "definition": "high praise", "example": "Greg’s excellent poem won the acclaim of his friends."}, {"word": "accolade", "sense": 1, "pos": "n.", "definition": "high praise, special distinction", "example": "Everyone offered accolades to Sam after he won the Noble Prize."}, {"word": "accommodating", "sense": 1, "pos": "adj.", "definition": "helpful, obliging, polite", "example": "Though the apartment was not big enough for three people, Arnold, Mark, and Zebulon were all friends and were accommodating to each other."}, {"word": "accord", "sense": 1, "pos": "n.", "definition": "an agreement", "example": "After much negotiating, England and Iceland finally came to a mutually beneficial accord about fishing rights off the cost of Greenland."}, {"word": "accost", "sense": 1, "pos": "v.", "definition": "to confront verbally", "example": "Though Antoinette was normally quite calm, when the waiter spilled soup on her for the fourth time in 15 minutes she stood up and accosted the man."}, {"word": "accretion", "sense": 1, "pos": "n.", "definition": "slow growth in size or amount", "example": "Stalactites are formed by the accretion of minerals from the roofs of caves."}, {"word": "acerbic", "sense": 1, "pos": "adj.", "definition": "biting, bitter in tone or taste", "example": "Jill became extremely acerbic and began to cruelly make fun of all her friends."}, {"word": "acquiesce", "sense": 1, "pos": "v.", "definition": "to agree without protesting", "example": "Though Mr. Correlli wanted to stay outside and work in his garage, when his wife told him that he had better come in to dinner, he acquiesced to her demands."}, {"word": "acrimony", "sense": 1, "pos": "n.", "definition": "bitterness, discord", "example": "Though they vowed that no girl would ever come between them, Biff and Trevor could not keep acrimony from overwhelming their friendship after they both fell in love with the lovely Teresa."}, {"word": "acumen", "sense": 1, "pos": "n.", "definition": "keen insight", "example": "Because of his mathematical acumen, Larry was able to figure out in minutes problems that took other students hours."}, {"word": "acute", "sense": 1, "pos": "adj.", "definition": "sharp, severe", "example": "Arnold could not walk because the pain in his foot was so acute."}, {"word": "acute", "sense": 2, "pos": "adj.", "definition": "having keen insight", "example": "Because she was so acute, Libby instantly figured out how the magician pulled off his “magic.”"}, {"word": "adamant", "sense": 1, "pos": "adj.", "definition": "impervious, immovable, unyielding", "example": "Though public pressure was intense, the President remained adamant about his proposal."}, {"word": "adept", "sense": 1, "pos": "adj.", "definition": "extremely skilled (Tarzan was adept at jumping from tree to tree like a monkey.) yralubacoV TAS", "example": ""}, {"word": "adhere", "sense": 1, "pos": "n.", "definition": "to stick to something", "example": "We adhered the poster to the wall with tape."}, {"word": "adhere", "sense": 2, "pos": "n.", "definition": "to follow devoutly", "example": "He adhered to the dictates of his religion without question."}, {"word": "admonish", "sense": 1, "pos": "v.", "definition": "to caution, criticize, reprove", "example": "Joe’s mother admonished him not to ruin his appetite by eating cookies before dinner."}, {"word": "adorn", "sense": 1, "pos": "v.", "definition": "to decorate", "example": "We adorned the tree with ornaments."}, {"word": "adroit", "sense": 1, "pos": "adj.", "definition": "skillful, dexterous", "example": "The adroit thief could pick someone’s pocket without attracting notice."}, {"word": "adulation", "sense": 1, "pos": "n.", "definition": "extreme praise", "example": "Though the book was pretty good, Marcy did not believe it deserved the adulation it received."}, {"word": "adumbrate", "sense": 1, "pos": "v.", "definition": "to sketch out in a vague way", "example": "The coach adumbrated a game plan, but none of the players knew precisely what to do."}, {"word": "adverse", "sense": 1, "pos": "adj.", "definition": "antagonistic, unfavorable, dangerous", "example": "Because of adverse conditions, the hikers decided to give up trying to climb the mountain."}, {"word": "advocate", "sense": 1, "pos": "v.", "definition": "to argue in favor of something", "example": "Arnold advocated turning left at the stop sign, even though everyone else thought we should turn right."}, {"word": "advocate", "sense": 2, "pos": "n.", "definition": "a person who argues in favor of something", "example": "In addition to wanting to turn left at every stop sign, Arnold was also a great advocate of increasing national defense spending."}, {"word": "aerial", "sense": 1, "pos": "adj.", "definition": "somehow related to the air", "example": "We watched as the fighter planes conducted aerial maneuvers."}, {"word": "aesthetic", "sense": 1, "pos": "adj.", "definition": "artistic, related to the appreciation of beauty", "example": "We hired Susan as our interior decorator because she has such a fine aesthetic sense."}, {"word": "affable", "sense": 1, "pos": "adj.", "definition": "friendly, amiable", "example": "People like to be around George because he is so affable and good-natured."}, {"word": "affinity", "sense": 1, "pos": "n.", "definition": "a spontaneous feeling of closeness", "example": "Jerry didn’t know why, but he felt an incredible affinity for Kramer the first time they met."}, {"word": "affluent", "sense": 1, "pos": "adj.", "definition": "rich, wealthy", "example": "Mrs. Grebelski was affluent, owning a huge house, three cars, and an island near Maine."}, {"word": "affront", "sense": 1, "pos": "n.", "definition": "an insult", "example": "Bernardo was very touchy, and took any slight as an affront to his honor."}, {"word": "aggrandize", "sense": 1, "pos": "v.", "definition": "to increase or make greater (Joseph always dropped the names of the famous people his father knew as a way to aggrandize his personal stature.) SAT Vocabulary", "example": ""}, {"word": "aggregate", "sense": 1, "pos": "n.", "definition": "a whole or total", "example": "The three branches of the U.S. Government form an aggregate much more powerful than its individual parts."}, {"word": "aggregate", "sense": 2, "pos": "v.", "definition": "to gather into a mass", "example": "The dictator tried to aggregate as many people into his army as he possibly could."}, {"word": "aggrieved", "sense": 1, "pos": "adj.", "definition": "distressed, wronged, injured", "example": "The foreman mercilessly overworked his aggrieved employees."}, {"word": "agile", "sense": 1, "pos": "adj.", "definition": "quick, nimble", "example": "The dogs were too slow to catch the agile rabbit."}, {"word": "agnostic", "sense": 1, "pos": "adj.", "definition": "believing that the existence of God cannot be proven or disproven", "example": "Joey’s parents are very religious, but he is agnostic."}, {"word": "agriculture", "sense": 1, "pos": "n.", "definition": "farming", "example": "It was a huge step in the progress of civilization when tribes left hunting and gathering and began to develop more sustainable methods of obtaining food, such as agriculture."}, {"word": "aisle", "sense": 1, "pos": "n.", "definition": "a passageway between rows of seats", "example": "Once we got inside the stadium we walked down the aisle to our seats."}, {"word": "alacrity", "sense": 1, "pos": "n.", "definition": "eagerness, speed", "example": "For some reason, Chuck loved to help his mother whenever he could, so when his mother asked him to set the table he did so with alacrity."}, {"word": "alias", "sense": 1, "pos": "n.", "definition": "a false name or identity", "example": "He snuck past the guards by using an alias and fake ID."}, {"word": "allay", "sense": 1, "pos": "v.", "definition": "to soothe, ease", "example": "The chairman of the Federal Reserve gave a speech to try to allay investors’ fears about an economic downturn."}, {"word": "allege", "sense": 1, "pos": "v.", "definition": "to assert, usually without proof", "example": "The policeman had alleged that Marshall committed the crime, but after the investigation turned up no evidence, Marshall was set free."}, {"word": "alleviate", "sense": 1, "pos": "v.", "definition": "to relieve, make more bearable", "example": "This drug will alleviate the symptoms of the terrible disease, but only for a while."}, {"word": "allocate", "sense": 1, "pos": "v.", "definition": "to distribute, set aside", "example": "The Mayor allocated 30 percent of the funds for improving the town’s schools."}, {"word": "aloof", "sense": 1, "pos": "adj.", "definition": "reserved, distant", "example": "The scientist could sometimes seem aloof, as if he didn’t care about his friends or family, but really he was just thinking about quantum mechanics."}, {"word": "altercation", "sense": 1, "pos": "n.", "definition": "a dispute, fight (Jason and Lionel blamed one another for the car accident, leading to an altercation.) yralubacoV TAS", "example": ""}, {"word": "amalgamate", "sense": 1, "pos": "v.", "definition": "to bring together, unite", "example": "Because of his great charisma, the presidential candidate was able to amalgamate all democrats and republicans under his banner."}, {"word": "ambiguous", "sense": 1, "pos": "adj.", "definition": "uncertain, variably interpretable", "example": "Some people think Caesar married Cleopatra for her power, others believe he was charmed by her beauty. His actual reasons are ambiguous."}, {"word": "ambivalent", "sense": 1, "pos": "adj.", "definition": "having opposing feelings", "example": "My feelings about Calvin are ambivalent because on one hand he is a loyal friend, but on the other, he is a cruel and vicious thief."}, {"word": "ameliorate", "sense": 1, "pos": "v.", "definition": "to improve", "example": "The tense situation was ameliorated when Sam proposed a solution everyone could agree upon."}, {"word": "amenable", "sense": 1, "pos": "adj.", "definition": "willing, compliant", "example": "Our father was amenable when we asked him to drive us to the farm so we could go apple picking."}, {"word": "amenity", "sense": 1, "pos": "n.", "definition": "an item that increases comfort", "example": "Bill Gates’s house is stocked with so many amenities, he never has to do anything for himself."}, {"word": "amiable", "sense": 1, "pos": "adj.", "definition": "friendly", "example": "An amiable fellow, Harry got along with just about everyone."}, {"word": "amicable", "sense": 1, "pos": "adj.", "definition": "friendly", "example": "Claudia and Jimmy got divorced, but amicably and without hard feelings."}, {"word": "amorous", "sense": 1, "pos": "adj.", "definition": "showing love, particularly sexual", "example": "Whenever Albert saw Mariah wear her slinky red dress, he began to feel quite amorous."}, {"word": "amorphous", "sense": 1, "pos": "adj.", "definition": "without definite shape or type", "example": "The effort was doomed from the start, because the reasons behind it were so amorphous and hard to pin down."}, {"word": "anachronistic", "sense": 1, "pos": "adj.", "definition": "being out of correct chronological order", "example": "In this book you’re writing, you say that the Pyramids were built after the Titanic sank, which is anachronistic."}, {"word": "analgesic", "sense": 1, "pos": "n.", "definition": "something that reduces pain", "example": "Put this analgesic on the wound so that the poor man at least feels a little better."}, {"word": "analogous", "sense": 1, "pos": "adj.", "definition": "similar to, so that an analogy can be drawn", "example": "Though they are unrelated genetically, the bone structure of whales and fish is quite analogous."}, {"word": "anarchist", "sense": 1, "pos": "n.", "definition": "one who wants to eliminate all government", "example": "An anarchist, Carmine wanted to dissolve every government everywhere."}, {"word": "anathema", "sense": 1, "pos": "n.", "definition": "a cursed, detested person (I never want to see that murderer. He is an anathema to me.) SAT Vocabulary", "example": ""}, {"word": "anecdote", "sense": 1, "pos": "n.", "definition": "a short, humorous account", "example": "After dinner, Marlon told an anecdote about the time he got his nose stuck in a toaster."}, {"word": "anesthesia", "sense": 1, "pos": "n.", "definition": "loss of sensation", "example": "When the nerves in his spine were damaged, Mr. Hollins suffered anesthesia in his legs."}, {"word": "anguish", "sense": 1, "pos": "n.", "definition": "extreme sadness, torment", "example": "Angelos suffered terrible anguish when he learned that Buffy had died while combating a strange mystical force of evil."}, {"word": "animated", "sense": 1, "pos": "adj.", "definition": "lively", "example": "When he begins to talk about drama, which is his true passion, he becomes very animated."}, {"word": "annex", "sense": 1, "pos": "v.", "definition": "to incorporate territory or space", "example": "After defeating them in battle, the Russians annexed Poland."}, {"word": "annex", "sense": 2, "pos": "n.", "definition": "a room attached to a larger room or space", "example": "He likes to do his studying in a little annex attached to the main reading room in the library."}, {"word": "annul", "sense": 1, "pos": "v.", "definition": "to make void or invalid", "example": "After seeing its unforeseen and catastrophic effects, Congress sought to annul the law."}, {"word": "anomaly", "sense": 1, "pos": "n.", "definition": "something that does not fit into the normal order", "example": "“That rip in the space- time continuum is certainly a spatial anomaly,” said Spock to Captain Kirk."}, {"word": "anonymous", "sense": 1, "pos": "adj.", "definition": "being unknown, unrecognized", "example": "Mary received a love poem from an anonymous admirer."}, {"word": "antagonism", "sense": 1, "pos": "n.", "definition": "hostility", "example": "Superman and Bizarro Superman shared a mutual antagonism, and often fought."}, {"word": "antecedent", "sense": 1, "pos": "n.", "definition": "something that came before", "example": "The great tradition of Western culture had its antecedent in the culture of Ancient Greece."}, {"word": "antediluvian", "sense": 1, "pos": "adj.", "definition": "ancient", "example": "The antediluvian man still believed that Eisenhower was president of the United States and that hot dogs cost a nickel."}, {"word": "anthology", "sense": 1, "pos": "n.", "definition": "a selected collection of writings, songs, etc.", "example": "The new anthology of Bob Dylan songs contains all his greatest hits and a few songs that you might never have heard before."}, {"word": "antipathy", "sense": 1, "pos": "n.", "definition": "a strong dislike, repugnance", "example": "I know you love me, but because you are a liar and a thief, I feel nothing but antipathy for you."}, {"word": "antiquated", "sense": 1, "pos": "adj.", "definition": "old, out of date", "example": "That antiquated car has none of the features, like power windows and steering, that make modern cars so great."}, {"word": "antiseptic", "sense": 1, "pos": "adj.", "definition": "clean, sterile (The antiseptic hospital was very bare, but its cleanliness helped to keep patients healthy.) yralubacoV TAS", "example": ""}, {"word": "antithesis", "sense": 1, "pos": "n.", "definition": "the absolute opposite", "example": "Your values, which hold war and violence in the highest esteem, are the antithesis of my pacifist beliefs."}, {"word": "anxiety", "sense": 1, "pos": "n.", "definition": "intense uneasiness", "example": "When he heard about the car crash, he felt anxiety because he knew that his girlfriend had been driving on the road where the accident occurred."}, {"word": "apathetic", "sense": 1, "pos": "adj.", "definition": "lacking concern, emotion", "example": "Uninterested in politics, Bruno was apathetic about whether he lived under a capitalist or communist regime."}, {"word": "apocryphal", "sense": 1, "pos": "adj.", "definition": "fictitious, false, wrong", "example": "Because I am standing before you, it seems obvious that the stories circulating about my demise were apocryphal."}, {"word": "appalling", "sense": 1, "pos": "adj.", "definition": "inspiring shock, horror, disgust", "example": "The judge found the murderer’s crimes and lack of remorse appalling."}, {"word": "appease", "sense": 1, "pos": "v.", "definition": "to calm, satisfy", "example": "When the child cries, the mother gives him candy to appease him."}, {"word": "appraise", "sense": 1, "pos": "v.", "definition": "to assess the worth or value of", "example": "A realtor will come over tonight to appraise our house."}, {"word": "apprehend", "sense": 1, "pos": "v.", "definition": "to seize, arrest", "example": "The criminal was apprehended at the scene."}, {"word": "apprehend", "sense": 2, "pos": "v.", "definition": "to perceive, understand, grasp", "example": "The student has trouble apprehending concepts in math and science."}, {"word": "approbation", "sense": 1, "pos": "n.", "definition": "praise", "example": "The crowd welcomed the heroes with approbation."}, {"word": "appropriate", "sense": 1, "pos": "v.", "definition": "to take, make use of", "example": "The government appropriated the farmer’s land without justification."}, {"word": "aquatic", "sense": 1, "pos": "adj.", "definition": "relating to water", "example": "The marine biologist studies starfish and other aquatic creatures."}, {"word": "arable", "sense": 1, "pos": "adj.", "definition": "suitable for growing crops", "example": "The farmer purchased a plot of arable land on which he will grow corn and sprouts."}, {"word": "arbiter", "sense": 1, "pos": "n.", "definition": "one who can resolve a dispute, make a decision", "example": "The divorce court judge will serve as the arbiter between the estranged husband and wife."}, {"word": "arbitrary", "sense": 1, "pos": "adj.", "definition": "based on factors that appear random", "example": "The boy’s decision to choose one college over another seems arbitrary."}, {"word": "arbitration", "sense": 1, "pos": "n.", "definition": "the process or act of resolving a dispute", "example": "The employee sought official arbitration when he could not resolve a disagreement with his supervisor."}, {"word": "arboreal", "sense": 1, "pos": "adj.", "definition": "of or relating to trees (Leaves, roots, and bark are a few arboreal traits.) SAT Vocabulary", "example": ""}, {"word": "arcane", "sense": 1, "pos": "adj.", "definition": "obscure, secret, known only by a few", "example": "The professor is an expert in arcane Lithuanian literature."}, {"word": "archaic", "sense": 1, "pos": "adj.", "definition": "of or relating to an earlier period in time, outdated", "example": "In a few select regions of Western Mongolian, an archaic Chinese dialect is still spoken."}, {"word": "archetypal", "sense": 1, "pos": "adj.", "definition": "the most representative or typical example of something", "example": "Some believe George Washington, with his flowing white hair and commanding stature, was the archetypal politician."}, {"word": "ardor", "sense": 1, "pos": "n.", "definition": "extreme vigor, energy, enthusiasm", "example": "The soldiers conveyed their ardor with impassioned battle cries."}, {"word": "arid", "sense": 1, "pos": "adj.", "definition": "excessively dry", "example": "Little other than palm trees and cacti grow successfully in arid environments."}, {"word": "arrogate", "sense": 1, "pos": "v.", "definition": "to take without justification", "example": "The king arrogated the right to order executions to himself exclusively."}, {"word": "artifact", "sense": 1, "pos": "n.", "definition": "a remaining piece from an extinct culture or place", "example": "The scientists spent all day searching the cave for artifacts from the ancient Mayan civilization."}, {"word": "artisan", "sense": 1, "pos": "n.", "definition": "a craftsman", "example": "The artisan uses wood to make walking sticks."}, {"word": "ascertain", "sense": 1, "pos": "v.", "definition": "to perceive, learn", "example": "With a bit of research, the student ascertained that some plants can live for weeks without water."}, {"word": "ascetic", "sense": 1, "pos": "adj.", "definition": "practicing restraint as a means of self-discipline, usually religious", "example": "The priest lives an ascetic life devoid of television, savory foods, and other pleasures."}, {"word": "ascribe", "sense": 1, "pos": "v.", "definition": "to assign, credit, attribute to", "example": "Some ascribe the invention of fireworks and dynamite to the Chinese."}, {"word": "aspersion", "sense": 1, "pos": "n.", "definition": "a curse, expression of ill-will", "example": "The rival politicians repeatedly cast aspersions on each others’ integrity."}, {"word": "aspire", "sense": 1, "pos": "v.", "definition": "to long for, aim toward", "example": "The young poet aspires to publish a book of verse someday."}, {"word": "assail", "sense": 1, "pos": "v.", "definition": "to attack", "example": "At dawn, the war planes assailed the boats in the harbor."}, {"word": "assess", "sense": 1, "pos": "v.", "definition": "to evaluate", "example": "A crew arrived to assess the damage after the crash."}, {"word": "assiduous", "sense": 1, "pos": "adj.", "definition": "hard-working, diligent", "example": "The construction workers erected the skyscraper during two years of assiduous labor."}, {"word": "assuage", "sense": 1, "pos": "v.", "definition": "to ease, pacify (The mother held the baby to assuage its fears.) yralubacoV TAS", "example": ""}, {"word": "astute", "sense": 1, "pos": "adj.", "definition": "very clever, crafty", "example": "Much of Roger’s success in politics results from his ability to provide astute answers to reporters’ questions."}, {"word": "asylum", "sense": 1, "pos": "n.", "definition": "a place of refuge, protection, a sanctuary", "example": "For Thoreau, the forest served as an asylum from the pressures of urban life."}, {"word": "asylum", "sense": 2, "pos": "n.", "definition": "an institution in which the insane are kept", "example": "Once diagnosed by a certified psychiatrist, the man was put in an asylum."}, {"word": "atone", "sense": 1, "pos": "v.", "definition": "to repent, make amends", "example": "The man atoned for forgetting his wife’s birthday by buying her five dozen roses."}, {"word": "atrophy", "sense": 1, "pos": "v.", "definition": "to wither away, decay", "example": "If muscles do not receive enough blood, they will soon atrophy and die."}, {"word": "attain", "sense": 1, "pos": "v.", "definition": "to achieve, arrive at", "example": "The athletes strived to attain their best times in competition."}, {"word": "attribute", "sense": 1, "pos": "v.", "definition": "to credit, assign", "example": "He attributes all of his success to his mother’s undying encouragement."}, {"word": "attribute", "sense": 2, "pos": "n.", "definition": "a facet or trait", "example": "Among the beetle’s most peculiar attributes is its thorny protruding eyes."}, {"word": "atypical", "sense": 1, "pos": "adj.", "definition": "not typical, unusual", "example": "Screaming and crying is atypical adult behavior."}, {"word": "audacious", "sense": 1, "pos": "adj.", "definition": "excessively bold", "example": "The security guard was shocked by the fan’s audacious attempt to offer him a bribe."}, {"word": "audible", "sense": 1, "pos": "adj.", "definition": "able to be heard", "example": "The missing person’s shouts were unfortunately not audible."}, {"word": "augment", "sense": 1, "pos": "v.", "definition": "to add to, expand", "example": "The eager student seeks to augment his knowledge of French vocabulary by reading French literature."}, {"word": "auspicious", "sense": 1, "pos": "adj.", "definition": "favorable, indicative of good things", "example": "The tennis player considered the sunny forecast an auspicious sign that she would win her match."}, {"word": "austere", "sense": 1, "pos": "adj.", "definition": "very bare, bleak", "example": "The austere furniture inside the abandoned house made the place feel haunted."}, {"word": "avarice", "sense": 1, "pos": "n.", "definition": "excessive greed", "example": "The banker’s avarice led him to amass a tremendous personal fortune."}, {"word": "avenge", "sense": 1, "pos": "v.", "definition": "to seek revenge", "example": "The victims will take justice into their own hands and strive to avenge themselves against the men who robbed them."}, {"word": "aversion", "sense": 1, "pos": "n.", "definition": "a particular dislike for something (Because he’s from Hawaii, Ben has an aversion to autumn, winter, and cold climates in general.) SAT Vocabulary", "example": ""}, {"word": "balk", "sense": 1, "pos": "v.", "definition": "to stop, block abruptly", "example": "Edna’s boss balked at her request for another raise."}, {"word": "ballad", "sense": 1, "pos": "n.", "definition": "a love song", "example": "Greta’s boyfriend played her a ballad on the guitar during their walk through the dark woods."}, {"word": "banal", "sense": 1, "pos": "adj.", "definition": "dull, commonplace", "example": "The client rejected our proposal because they found our presentation banal and unimpressive."}, {"word": "bane", "sense": 1, "pos": "n.", "definition": "a burden", "example": "Advanced physics is the bane of many students’ academic lives."}, {"word": "bard", "sense": 1, "pos": "n.", "definition": "a poet, often a singer as well", "example": "Shakespeare is often considered the greatest bard in the history of the English language."}, {"word": "bashful", "sense": 1, "pos": "adj.", "definition": "shy, excessively timid", "example": "Frankie’s mother told him not to be bashful when he refused to attend the birthday party."}, {"word": "battery", "sense": 1, "pos": "n.", "definition": "a device that supplies power", "example": "Most cars run on a combination of power from a battery and gasoline."}, {"word": "battery", "sense": 2, "pos": "n.", "definition": "assault, beating", "example": "Her husband was accused of assault and battery after he attacked a man on the sidewalk."}, {"word": "beguile", "sense": 1, "pos": "v.", "definition": "to trick, deceive", "example": "The thief beguiled his partners into surrendering all of their money to him."}, {"word": "behemoth", "sense": 1, "pos": "n.", "definition": "something of tremendous power or size", "example": "The new aircraft carrier is among several behemoths that the Air Force has added to its fleet."}, {"word": "benevolent", "sense": 1, "pos": "adj.", "definition": "marked by goodness or doing good", "example": "Police officers should be commended for their benevolent service to the community."}, {"word": "benign", "sense": 1, "pos": "adj.", "definition": "favorable, not threatening, mild", "example": "We were all relieved to hear that the medical tests determined her tumor to be benign."}, {"word": "bequeath", "sense": 1, "pos": "v.", "definition": "to pass on, give", "example": "Jon’s father bequeathed his entire estate to his mother."}, {"word": "berate", "sense": 1, "pos": "v.", "definition": "to scold vehemently", "example": "The angry boss berated his employees for failing to meet their deadline."}, {"word": "bereft", "sense": 1, "pos": "adj.", "definition": "devoid of, without", "example": "His family was bereft of food and shelter following the tornado."}, {"word": "beseech", "sense": 1, "pos": "v.", "definition": "to beg, plead, implore", "example": "The servant beseeched the king for food to feed his starving family."}, {"word": "bias", "sense": 1, "pos": "n.", "definition": "a tendency, inclination, prejudice (The judge’s hidden bias against smokers led him to make an unfair decision.) yralubacoV TAS", "example": ""}, {"word": "bilk", "sense": 1, "pos": "v.", "definition": "cheat, defraud", "example": "The lawyer discovered that this firm had bilked several clients out of thousands of dollars."}, {"word": "blandish", "sense": 1, "pos": "v.", "definition": "to coax by using flattery", "example": "Rachel’s assistant tried to blandish her into accepting the deal."}, {"word": "blemish", "sense": 1, "pos": "n.", "definition": "an imperfection, flaw", "example": "The dealer agreed to lower the price because of the many blemishes on the surface of the wooden furniture."}, {"word": "blight", "sense": 1, "pos": "n.", "definition": "a plague, disease", "example": "The potato blight destroyed the harvest and bankrupted many families."}, {"word": "blight", "sense": 2, "pos": "n.", "definition": "something that destroys hope", "example": "His bad morale is a blight upon this entire operation."}, {"word": "boisterous", "sense": 1, "pos": "adj.", "definition": "loud and full of energy", "example": "The candidate won the vote after giving several boisterous speeches on television."}, {"word": "bombastic", "sense": 1, "pos": "adj.", "definition": "excessively confident, pompous", "example": "The singer’s bombastic performance disgusted the crowd."}, {"word": "boon", "sense": 1, "pos": "n.", "definition": "a gift or blessing", "example": "The good weather has been a boon for many businesses located near the beach."}, {"word": "bourgeois", "sense": 1, "pos": "n.", "definition": "a middle-class person, capitalist", "example": "Many businessmen receive criticism for their bourgeois approach to life."}, {"word": "brazen", "sense": 1, "pos": "adj.", "definition": "excessively bold, brash", "example": "Critics condemned the novelist’s brazen attempt to plagiarize Hemingway’s story."}, {"word": "brusque", "sense": 1, "pos": "adj.", "definition": "short, abrupt, dismissive", "example": "The captain’s brusque manner offended the passengers."}, {"word": "buffet", "sense": 1, "pos": "v.", "definition": "to strike with force", "example": "The strong winds buffeted the ships, threatening to capsize them."}, {"word": "buffet", "sense": 2, "pos": "n.", "definition": "an arrangement of food set out on a table", "example": "Rather than sitting around a table, the guests took food from our buffet and ate standing up."}, {"word": "burnish", "sense": 1, "pos": "v.", "definition": "to polish, shine", "example": "His mother asked him to burnish the silverware before setting the table."}, {"word": "buttress", "sense": 1, "pos": "v.", "definition": "to support, hold up", "example": "The column buttresses the roof above the statue."}, {"word": "buttress", "sense": 2, "pos": "n.", "definition": "something that offers support", "example": "The buttress supports the roof above the statues."}, {"word": "cacophony", "sense": 1, "pos": "n.", "definition": "tremendous noise, disharmonious sound (The elementary school orchestra created a cacophony at the recital.) SAT Vocabulary", "example": ""}, {"word": "cadence", "sense": 1, "pos": "n.", "definition": "a rhythm, progression of sound", "example": "The pianist used the foot pedal to emphasize the cadence of the sonata."}, {"word": "cajole", "sense": 1, "pos": "v.", "definition": "to urge, coax", "example": "Fred’s buddies cajoled him into attending the bachelor party."}, {"word": "calamity", "sense": 1, "pos": "n.", "definition": "an event with disastrous consequences", "example": "The earthquake in San Francisco was a calamity worse than any other natural disaster in history."}, {"word": "calibrate", "sense": 1, "pos": "v.", "definition": "to set, standardize", "example": "The mechanic calibrated the car’s transmission to make the motor run most efficiently."}, {"word": "callous", "sense": 1, "pos": "adj.", "definition": "harsh, cold, unfeeling", "example": "The murderer’s callous lack of remorse shocked the jury."}, {"word": "calumny", "sense": 1, "pos": "n.", "definition": "an attempt to spoil someone else’s reputation by spreading lies", "example": "The local official’s calumny ended up ruining his opponent’s prospect of winning the election."}, {"word": "camaraderie", "sense": 1, "pos": "n.", "definition": "brotherhood, jovial unity", "example": "Camaraderie among employees usually leads to success in business."}, {"word": "candor", "sense": 1, "pos": "n.", "definition": "honesty, frankness", "example": "We were surprised by the candor of the mayor’s speech because he is usually rather evasive."}, {"word": "canny", "sense": 1, "pos": "adj.", "definition": "shrewd, careful", "example": "The canny runner hung at the back of the pack through much of the race to watch the other runners, and then sprinted past them at the end."}, {"word": "canvas", "sense": 1, "pos": "n.", "definition": "a piece of cloth on which an artist paints", "example": "Picasso liked to work on canvas rather than on bare cement."}, {"word": "canvas", "sense": 2, "pos": "v.", "definition": "to cover, inspect", "example": "We canvassed the neighborhood looking for clues."}, {"word": "capacious", "sense": 1, "pos": "adj.", "definition": "very spacious", "example": "The workers delighted in their new capacious office space."}, {"word": "capitulate", "sense": 1, "pos": "v.", "definition": "to surrender", "example": "The army finally capitulated after fighting a long costly battle."}, {"word": "capricious", "sense": 1, "pos": "adj.", "definition": "subject to whim, fickle", "example": "The young girl’s capricious tendencies made it difficult for her to focus on achieving her goals."}, {"word": "captivate", "sense": 1, "pos": "v.", "definition": "to get the attention of, hold", "example": "The fireworks captivated the young boy, who had never seen such things before."}, {"word": "carouse", "sense": 1, "pos": "v.", "definition": "to party, celebrate", "example": "We caroused all night after getting married."}, {"word": "carp", "sense": 1, "pos": "v.", "definition": "to annoy, pester (The husband divorced his wife after listening to her carping voice for decades.) yralubacoV TAS", "example": ""}, {"word": "catalog", "sense": 1, "pos": "v.", "definition": "to list, enter into a list", "example": "The judge cataloged the victim’s injuries before calculating how much money he would award."}, {"word": "catalog", "sense": 2, "pos": "n.", "definition": "a list or collection", "example": "We received a catalog from J. Crew that displayed all of their new items."}, {"word": "catalyze", "sense": 1, "pos": "v.", "definition": "to charge, inspire", "example": "The president’s speech catalyzed the nation and resuscitated the economy."}, {"word": "caucus", "sense": 1, "pos": "n.", "definition": "a meeting usually held by people working toward the same goal", "example": "The ironworkers held a caucus to determine how much of a pay increase they would request."}, {"word": "caustic", "sense": 1, "pos": "adj.", "definition": "bitter, biting, acidic", "example": "The politicians exchanged caustic insults for over an hour during the debate."}, {"word": "cavort", "sense": 1, "pos": "v.", "definition": "to leap about, behave boisterously", "example": "The adults ate their dinners on the patio, while the children cavorted around the pool."}, {"word": "censure", "sense": 1, "pos": "n.", "definition": "harsh criticism", "example": "The frustrated teenager could not put up with anymore of her critical mother’s censure."}, {"word": "censure", "sense": 2, "pos": "v.", "definition": "to rebuke formally", "example": "The principal censured the head of the English Department for forcing students to learn esoteric vocabulary."}, {"word": "cerebral", "sense": 1, "pos": "adj.", "definition": "related to the intellect", "example": "The books we read in this class are too cerebral— they don’t engage my emotions at all."}, {"word": "chaos", "sense": 1, "pos": "n.", "definition": "absolute disorder", "example": "Mr. Thornton’s sudden departure for the lavatory plunged his classroom into chaos."}, {"word": "chastise", "sense": 1, "pos": "v.", "definition": "to criticize severely", "example": "After being chastised by her peers for mimicking Britney Spears, Miranda dyed her hair black and affected a Gothic style."}, {"word": "cherish", "sense": 1, "pos": "v.", "definition": "to feel or show affection toward something", "example": "She continued to cherish her red plaid trousers, even though they had gone out of style and no longer fit her."}, {"word": "chide", "sense": 1, "pos": "v.", "definition": "to voice disapproval", "example": "Lucy chided Russell for his vulgar habits and sloppy appearance."}, {"word": "choreography", "sense": 1, "pos": "n.", "definition": "the arrangement of dances", "example": "The plot of the musical was banal, but the choreography was stunning."}, {"word": "chronicle", "sense": 1, "pos": "n.", "definition": "a written history", "example": "The library featured the newly updated chronicle of World War II."}, {"word": "chronicle", "sense": 2, "pos": "v.", "definition": "to write a history", "example": "Albert’s diary chronicled the day-to-day growth of his obsession with Cynthia."}, {"word": "chronological", "sense": 1, "pos": "adj.", "definition": "arranged in order of time (Lionel carefully arranged the snapshots of his former girlfriends in chronological order, and then set fire to them.) SAT Vocabulary", "example": ""}, {"word": "circuitous", "sense": 1, "pos": "adj.", "definition": "roundabout", "example": "The bus’s circuitous route took us through numerous outlying suburbs."}, {"word": "circumlocution", "sense": 1, "pos": "n.", "definition": "indirect and wordy language", "example": "The professor’s habit of speaking in circumlocutions made it difficult to follow his lectures."}, {"word": "circumscribed", "sense": 1, "pos": "adj.", "definition": "marked off, bounded", "example": "The children were permitted to play tag only within a carefully circumscribed area of the lawn."}, {"word": "circumspect", "sense": 1, "pos": "adj.", "definition": "cautious", "example": "Though I promised Rachel’s father I would bring her home promptly by midnight, it would have been more circumspect not to have specified a time."}, {"word": "circumvent", "sense": 1, "pos": "v.", "definition": "to get around", "example": "The school’s dress code forbidding navel-baring jeans was circumvented by the determined students, who were careful to cover up with long coats when administrators were nearby."}, {"word": "clairvoyant", "sense": 1, "pos": "adj.", "definition": "able to perceive things that normal people cannot", "example": "Zelda’s uncanny ability to detect my lies was nothing short of clairvoyant."}, {"word": "clamor", "sense": 1, "pos": "n.", "definition": "loud noise", "example": "Each morning the birds outside my window make such a clamor that they wake me up."}, {"word": "clamor", "sense": 2, "pos": "v.", "definition": "to loudly insist", "example": "Neville’s fans clamored for him to appear on stage, but he had passed out on the floor of his dressing room."}, {"word": "clandestine", "sense": 1, "pos": "adj.", "definition": "secret", "example": "Announcing to her boyfriend that she was going to the gym, Sophie actually went to meet Joseph for a clandestine liaison."}, {"word": "cleave", "sense": 1, "pos": "v.", "definition": "to divide into parts", "example": "Following the scandalous disgrace of their leader, the entire political party cleaved into warring factions."}, {"word": "cleave", "sense": 2, "pos": "v.", "definition": "to stick together firmly", "example": "After resolving their marital problems, Junior and Rosa cleaved to one another all the more tightly."}, {"word": "clemency", "sense": 1, "pos": "n.", "definition": "mercy", "example": "After he forgot their anniversary, Martin could only beg Maria for clemency."}, {"word": "clergy", "sense": 1, "pos": "n.", "definition": "members of Christian holy orders", "example": "Though the villagers viewed the church rectory as quaint and charming, the clergy who lived there regarded it as a mildewy and dusty place that aggravated their allergies."}, {"word": "cloying", "sense": 1, "pos": "adj.", "definition": "sickeningly sweet", "example": "Though Ronald was physically attractive, Maud found his constant compliments and solicitous remarks cloying."}, {"word": "coagulate", "sense": 1, "pos": "v.", "definition": "to thicken, clot (The top layer of the pudding had coagulated into a thick skin.) yralubacoV TAS", "example": ""}, {"word": "coalesce", "sense": 1, "pos": "v.", "definition": "to fuse into a whole", "example": "Gordon’s ensemble of thrift-shop garments coalesced into a surprisingly handsome outfit."}, {"word": "cobbler", "sense": 1, "pos": "n.", "definition": "a person who makes or repairs shoes", "example": "I had my neighborhood cobbler replace my worn-out leather soles with new ones."}, {"word": "coerce", "sense": 1, "pos": "v.", "definition": "to make somebody do something by force or threat", "example": "The court decided that Vanilla Ice did not have to honor the contract because he had been coerced into signing it."}, {"word": "cogent", "sense": 1, "pos": "adj.", "definition": "intellectually convincing", "example": "Irene’s arguments in favor of abstinence were so cogent that I could not resist them."}, {"word": "cognizant", "sense": 1, "pos": "adj.", "definition": "aware, mindful", "example": "Jake avoided speaking to women in bars because he was cognizant of the fact that drinking impairs his judgment."}, {"word": "coherent", "sense": 1, "pos": "adj.", "definition": "logically consistent, intelligible", "example": "Renee could not figure out what Monroe had seen because he was too distraught to deliver a coherent statement."}, {"word": "collateral", "sense": 1, "pos": "adj.", "definition": "secondary", "example": "Divorcing my wife had the collateral effect of making me poor, as she was the only one of us with a job or money."}, {"word": "collateral", "sense": 2, "pos": "n.", "definition": "security for a debt", "example": "Jacob left his watch as collateral for the $500 loan."}, {"word": "colloquial", "sense": 1, "pos": "adj.", "definition": "characteristic of informal conversation", "example": "Adam’s essay on sexual response in primates was marked down because it contained too many colloquial expressions."}, {"word": "collusion", "sense": 1, "pos": "n.", "definition": "secret agreement, conspiracy", "example": "The three law students worked in collusion to steal the final exam."}, {"word": "colossus", "sense": 1, "pos": "n.", "definition": "a gigantic statue or thing", "example": "For 56 years, the ancient city of Rhodes featured a colossus standing astride its harbor."}, {"word": "combustion", "sense": 1, "pos": "n.", "definition": "the act or process of burning", "example": "The unexpected combustion of the prosecution’s evidence forced the judge to dismiss the case against Ramirez."}, {"word": "commendation", "sense": 1, "pos": "n.", "definition": "a notice of approval or recognition", "example": "Jared received a commendation from Linda, his supervisor, for his stellar performance."}, {"word": "commensurate", "sense": 1, "pos": "adj.", "definition": "corresponding in size or amount", "example": "Ahab selected a very long roll and proceeded to prepare a tuna salad sandwich commensurate with his enormous appetite."}, {"word": "commodious", "sense": 1, "pos": "adj.", "definition": "roomy (Holden invited the three women to join him in the back seat of the taxicab, assuring them that the car was quite commodious.) SAT Vocabulary", "example": ""}, {"word": "compelling", "sense": 1, "pos": "adj.", "definition": "forceful, demanding attention", "example": "Eliot’s speech was so compelling that Lenore accepted his proposal on the spot."}, {"word": "compensate", "sense": 1, "pos": "v.", "definition": "to make an appropriate payment for something", "example": "Reginald bought Sharona a new dress to compensate her for the one he’d spilled his ice cream on."}, {"word": "complacency", "sense": 1, "pos": "n.", "definition": "self-satisfied ignorance of danger", "example": "Colin tried to shock his friends out of their complacency by painting a frightening picture of what might happen to them."}, {"word": "complement", "sense": 1, "pos": "v.", "definition": "to complete, make perfect", "example": "Ann’s scarf complements her blouse beautifully, making her seem fully dressed even though she isn’t wearing a coat."}, {"word": "compliant", "sense": 1, "pos": "adj.", "definition": "ready to adapt oneself to another’s wishes", "example": "Sue had very strong opinions about what to do on a first date, and Ted was absolutely compliant."}, {"word": "complicit", "sense": 1, "pos": "adj.", "definition": "being an accomplice in a wrongful act", "example": "By keeping her daughter’s affair a secret, Maddie became complicit in it."}, {"word": "compliment", "sense": 1, "pos": "n.", "definition": "an expression of esteem or approval", "example": "I blushed crimson when Emma gave me a compliment on my new haircut."}, {"word": "compound", "sense": 1, "pos": "v.", "definition": "to combine parts", "example": "The difficulty of finding a fire escape amid the smoke was compounded with the dangers posed by the panicking crowds."}, {"word": "compound", "sense": 2, "pos": "n.", "definition": "a combination of different parts", "example": "My attraction to Donna was a compound of curiosity about the unknown, physical desire, and intellectual admiration."}, {"word": "compound", "sense": 3, "pos": "n.", "definition": "a walled area containing a group of buildings", "example": "When the fighting started, Joseph rushed into the family compound because it was safe and well defended."}, {"word": "comprehensive", "sense": 1, "pos": "adj.", "definition": "including everything", "example": "She sent me a comprehensive list of the ingredients needed to cook rabbit soufflé."}, {"word": "compress", "sense": 1, "pos": "v.", "definition": "to apply pressure, squeeze together", "example": "Lynn compressed her lips into a frown."}, {"word": "compunction", "sense": 1, "pos": "n.", "definition": "distress caused by feeling guilty", "example": "He felt compunction for the shabby way he’d treated her."}, {"word": "concede", "sense": 1, "pos": "v.", "definition": "to accept as valid", "example": "Andrew had to concede that what his mother said about Diana made sense."}, {"word": "conciliatory", "sense": 1, "pos": "adj.", "definition": "friendly, agreeable (I took Amanda’s invitation to dinner as a very conciliatory gesture.) yralubacoV TAS", "example": ""}, {"word": "concise", "sense": 1, "pos": "adj.", "definition": "brief and direct in expression", "example": "Gordon did not like to waste time, and his instructions to Brenda were nothing if not concise."}, {"word": "concoct", "sense": 1, "pos": "v.", "definition": "to fabricate, make up", "example": "She concocted the most ridiculous story to explain her absence."}, {"word": "concomitant", "sense": 1, "pos": "adj.", "definition": "accompanying in a subordinate fashion", "example": "His dislike of hard work carried with it a concomitant lack of funds."}, {"word": "concord", "sense": 1, "pos": "n.", "definition": "harmonious agreement", "example": "Julie and Harold began the evening with a disagreement, but ended it in a state of perfect concord."}, {"word": "condolence", "sense": 1, "pos": "n.", "definition": "an expression of sympathy in sorrow", "example": "Brian lamely offered his condolences on the loss of his sister’s roommate’s cat."}, {"word": "condone", "sense": 1, "pos": "v.", "definition": "to pardon, deliberately overlook", "example": "He refused to condone his brother’s crime."}, {"word": "conduit", "sense": 1, "pos": "n.", "definition": "a pipe or channel through which something passes", "example": "The water flowed through the conduit into the container."}, {"word": "confection", "sense": 1, "pos": "n.", "definition": "a sweet, fancy food", "example": "We went to the mall food court and purchased a delicious confection."}, {"word": "confidant", "sense": 1, "pos": "n.", "definition": "a person entrusted with secrets", "example": "Shortly after we met, she became my chief confidant."}, {"word": "conflagration", "sense": 1, "pos": "n.", "definition": "great fire", "example": "The conflagration consumed the entire building."}, {"word": "confluence", "sense": 1, "pos": "n.", "definition": "a gathering together", "example": "A confluence of different factors made tonight the perfect night."}, {"word": "conformist", "sense": 1, "pos": "n.", "definition": "one who behaves the same as others", "example": "Julian was such a conformist that he had to wait and see if his friends would do something before he would commit."}, {"word": "confound", "sense": 1, "pos": "v.", "definition": "to frustrate, confuse", "example": "MacGuyver confounded the policemen pursuing him by covering his tracks."}, {"word": "congeal", "sense": 1, "pos": "v.", "definition": "to thicken into a solid", "example": "The sauce had congealed into a thick paste."}, {"word": "congenial", "sense": 1, "pos": "adj.", "definition": "pleasantly agreeable", "example": "His congenial manner made him popular wherever he went."}, {"word": "congregation", "sense": 1, "pos": "n.", "definition": "a gathering of people, especially for religious services", "example": "The priest told the congregation that he would be retiring."}, {"word": "congruity", "sense": 1, "pos": "n.", "definition": "the quality of being in agreement (Bill and Veronica achieved a perfect congruity of opinion.) SAT Vocabulary", "example": ""}, {"word": "connive", "sense": 1, "pos": "v.", "definition": "to plot, scheme", "example": "She connived to get me to give up my vacation plans."}, {"word": "consecrate", "sense": 1, "pos": "v.", "definition": "to dedicate something to a holy purpose", "example": "Arvin consecrated his spare bedroom as a shrine to Christina."}, {"word": "consensus", "sense": 1, "pos": "n.", "definition": "an agreement of opinion", "example": "The jury was able to reach a consensus only after days of deliberation."}, {"word": "consign", "sense": 1, "pos": "v.", "definition": "to give something over to another’s care", "example": "Unwillingly, he consigned his mother to a nursing home."}, {"word": "consolation", "sense": 1, "pos": "n.", "definition": "an act of comforting", "example": "Darren found Alexandra’s presence to be a consolation for his suffering."}, {"word": "consonant", "sense": 1, "pos": "adj.", "definition": "in harmony", "example": "The singers’ consonant voices were beautiful."}, {"word": "constituent", "sense": 1, "pos": "n.", "definition": "an essential part", "example": "The most important constituent of her perfume is something called ambergris."}, {"word": "constrain", "sense": 1, "pos": "v.", "definition": "to forcibly restrict", "example": "His belief in nonviolence constrained him from taking revenge on his attackers."}, {"word": "construe", "sense": 1, "pos": "v.", "definition": "to interpret", "example": "He construed her throwing his clothes out the window as a signal that she wanted him to leave."}, {"word": "consummate", "sense": 1, "pos": "v.", "definition": "to complete a deal; to complete a marriage ceremony through sexual intercourse", "example": "Erica and Donald consummated their agreement in the executive boardroom."}, {"word": "consumption", "sense": 1, "pos": "n.", "definition": "the act of consuming", "example": "Consumption of intoxicating beverages is not permitted on these premises."}, {"word": "contemporaneous", "sense": 1, "pos": "adj.", "definition": "existing during the same time", "example": "Though her novels do not feature the themes of Romanticism, Jane Austen’s work was contemporaneous with that of Wordsworth and Byron."}, {"word": "contentious", "sense": 1, "pos": "adj.", "definition": "having a tendency to quarrel or dispute", "example": "George’s contentious personality made him unpopular with his classmates."}, {"word": "contravene", "sense": 1, "pos": "v.", "definition": "to contradict, oppose, violate", "example": "Edwidge contravened his landlady’s rule against overnight guests."}, {"word": "contrite", "sense": 1, "pos": "adj.", "definition": "penitent, eager to be forgiven", "example": "Blake’s contrite behavior made it impossible to stay angry at him."}, {"word": "contusion", "sense": 1, "pos": "n.", "definition": "bruise, injury (The contusions on his face suggested he’d been in a fight.) yralubacoV TAS", "example": ""}, {"word": "conundrum", "sense": 1, "pos": "n.", "definition": "puzzle, problem", "example": "Interpreting Jane’s behavior was a constant conundrum."}, {"word": "convene", "sense": 1, "pos": "v.", "definition": "to call together", "example": "Jason convened his entire extended family for a discussion."}, {"word": "convention", "sense": 1, "pos": "n.", "definition": "an assembly of people", "example": "The hotel was full because of the cattle- ranchers’ convention."}, {"word": "convention", "sense": 2, "pos": "n.", "definition": "a rule, custom", "example": "The cattle-ranchers have a convention that you take off your boots before entering their houses."}, {"word": "convivial", "sense": 1, "pos": "adj.", "definition": "characterized by feasting, drinking, merriment", "example": "The restaurant’s convivial atmosphere put me immediately at ease."}, {"word": "convoluted", "sense": 1, "pos": "adj.", "definition": "intricate, complicated", "example": "Grace’s story was so convoluted that I couldn’t follow it."}, {"word": "copious", "sense": 1, "pos": "adj.", "definition": "profuse, abundant", "example": "Copious amounts of Snapple were imbibed in the cafeteria."}, {"word": "cordial", "sense": 1, "pos": "adj.", "definition": "warm, affectionate", "example": "His cordial greeting melted my anger at once."}, {"word": "coronation", "sense": 1, "pos": "n.", "definition": "the act of crowning", "example": "The new king’s coronation occurred the day after his father’s death."}, {"word": "corpulence", "sense": 1, "pos": "adj.", "definition": "extreme fatness", "example": "Henry’s corpulence did not make him any less attractive to his charming, svelte wife."}, {"word": "corroborate", "sense": 1, "pos": "v.", "definition": "to support with evidence", "example": "Luke’s seemingly outrageous claim was corroborated by witnesses."}, {"word": "corrosive", "sense": 1, "pos": "adj.", "definition": "having the tendency to erode or eat away", "example": "The effect of the chemical was highly corrosive."}, {"word": "cosmopolitan", "sense": 1, "pos": "adj.", "definition": "sophisticated, worldly", "example": "Lloyd’s education and upbringing were cosmopolitan, so he felt right at home among the powerful and learned."}, {"word": "counteract", "sense": 1, "pos": "v.", "definition": "to neutralize, make ineffective", "example": "The antidote counteracted the effect of the poison."}, {"word": "coup", "sense": 1, "pos": "n.", "definition": "a brilliant, unexpected act", "example": "Alexander pulled off an amazing coup when he got a date with Cynthia by purposely getting hit by her car."}, {"word": "coup", "sense": 2, "pos": "n.", "definition": "the overthrow of a government and assumption of authority", "example": "In their coup attempt, the army officers stormed the Parliament and took all the legislators hostage."}, {"word": "covet", "sense": 1, "pos": "v.", "definition": "to desire enviously (I coveted Moses’s house, wife, and car.) SAT Vocabulary", "example": ""}, {"word": "covert", "sense": 1, "pos": "adj.", "definition": "secretly engaged in", "example": "Nerwin waged a covert campaign against his enemies, while outwardly appearing to remain friendly."}, {"word": "credulity", "sense": 1, "pos": "n.", "definition": "readiness to believe", "example": "His credulity made him an easy target for con men."}, {"word": "crescendo", "sense": 1, "pos": "n.", "definition": "a steady increase in intensity or volume", "example": "The crescendo of the brass instruments gave the piece a patriotic feel."}, {"word": "criteria", "sense": 1, "pos": "n.", "definition": "standards by which something is judged", "example": "Among Mrs. Fields’s criteria for good cookies are that they be moist and chewy."}, {"word": "culmination", "sense": 1, "pos": "n.", "definition": "the climax toward which something progresses", "example": "The culmination of the couple’s argument was the decision to divorce."}, {"word": "culpable", "sense": 1, "pos": "adj.", "definition": "deserving blame", "example": "He was culpable of the crime, and was sentenced to perform community service for 75 years."}, {"word": "cultivate", "sense": 1, "pos": "v.", "definition": "to nurture, improve, refine", "example": "At the library, she cultivated her interest in spy novels."}, {"word": "cumulative", "sense": 1, "pos": "adj.", "definition": "increasing, building upon itself", "example": "The cumulative effect of hours spent in the sun was a deep tan."}, {"word": "cunning", "sense": 1, "pos": "adj.", "definition": "sly, clever at being deceitful", "example": "The general devised a cunning plan to surprise the enemy."}, {"word": "cupidity", "sense": 1, "pos": "n.", "definition": "greed, strong desire", "example": "His cupidity made him enter the abandoned gold mine despite the obvious dangers."}, {"word": "cursory", "sense": 1, "pos": "adj.", "definition": "brief to the point of being superficial", "example": "Late for the meeting, she cast a cursory glance at the agenda."}, {"word": "curt", "sense": 1, "pos": "adj.", "definition": "abruptly and rudely short", "example": "Her curt reply to my question made me realize that she was upset at me."}, {"word": "curtail", "sense": 1, "pos": "v.", "definition": "to lessen, reduce", "example": "Since losing his job, he had to curtail his spending."}, {"word": "daunting", "sense": 1, "pos": "adj.", "definition": "intimidating, causing one to lose courage", "example": "He kept delaying the daunting act of asking for a promotion."}, {"word": "dearth", "sense": 1, "pos": "n.", "definition": "a lack, scarcity", "example": "An eager reader, she was dismayed by the dearth of classic books at the library."}, {"word": "debacle", "sense": 1, "pos": "n.", "definition": "a disastrous failure, disruption (The elaborately designed fireworks show turned into a debacle when the fireworks started firing in random directions.) yralubacoV TAS", "example": ""}, {"word": "debase", "sense": 1, "pos": "v.", "definition": "to lower the quality or esteem of something", "example": "The large raise that he gave himself debased his motives for running the charity."}, {"word": "debauch", "sense": 1, "pos": "v.", "definition": "to corrupt by means of sensual pleasures", "example": "An endless amount of good wine and cheese debauched the traveler."}, {"word": "debunk", "sense": 1, "pos": "v.", "definition": "to expose the falseness of something", "example": "He debunked her claim to be the world’s greatest chess player by defeating her in 18 consecutive matches."}, {"word": "decorous", "sense": 1, "pos": "adj.", "definition": "socially proper, appropriate", "example": "The appreciative guest displayed decorous behavior toward his host."}, {"word": "decry", "sense": 1, "pos": "v.", "definition": "to criticize openly", "example": "The kind video rental clerk decried the policy of charging customers late fees."}, {"word": "deface", "sense": 1, "pos": "v.", "definition": "to ruin or injure something’s appearance", "example": "The brothers used eggs and shaving cream to deface their neighbor’s mailbox."}, {"word": "defamatory", "sense": 1, "pos": "adj.", "definition": "harmful toward another’s reputation", "example": "The defamatory gossip spreading about the actor made the public less willing to see the actor’s new movie."}, {"word": "defer", "sense": 1, "pos": "v.", "definition": "to postpone something; to yield to another’s wisdom", "example": "Ron deferred to Diane, the expert on musical instruments, when he was asked about buying a piano."}, {"word": "deferential", "sense": 1, "pos": "adj.", "definition": "showing respect for another’s authority", "example": "His deferential attitude toward her made her more confident in her ability to run the company."}, {"word": "defile", "sense": 1, "pos": "v.", "definition": "to make unclean, impure", "example": "She defiled the calm of the religious building by playing her banjo."}, {"word": "deft", "sense": 1, "pos": "adj.", "definition": "skillful, capable", "example": "Having worked in a bakery for many years, Marcus was a deft bread maker."}, {"word": "defunct", "sense": 1, "pos": "adj.", "definition": "no longer used or existing", "example": "They planned to turn the defunct schoolhouse into a community center."}, {"word": "delegate", "sense": 1, "pos": "v.", "definition": "to hand over responsibility for something", "example": "The dean delegated the task of finding a new professor to a special hiring committee."}, {"word": "deleterious", "sense": 1, "pos": "adj.", "definition": "harmful", "example": "She experienced the deleterious effects of running a marathon without stretching her muscles enough beforehand."}, {"word": "deliberate", "sense": 1, "pos": "adj.", "definition": "intentional, reflecting careful consideration", "example": "Though Mary was quite upset, her actions to resolve the dispute were deliberate."}, {"word": "delineate", "sense": 1, "pos": "v.", "definition": "to describe, outline, shed light on (She neatly delineated her reasons for canceling the project’s funding.) SAT Vocabulary", "example": ""}, {"word": "demagogue", "sense": 1, "pos": "n.", "definition": "a leader who appeals to a people’s prejudices", "example": "The demagogue strengthened his hold over his people by blaming immigrants for the lack of jobs."}, {"word": "demarcation", "sense": 1, "pos": "n.", "definition": "the marking of boundaries or categories", "example": "Different cultures have different demarcations of good and evil."}, {"word": "demean", "sense": 1, "pos": "v.", "definition": "to lower the status or stature of something", "example": "She refused to demean her secretary by making him order her lunch."}, {"word": "demure", "sense": 1, "pos": "adj.", "definition": "quiet, modest, reserved", "example": "Though everyone else at the party was dancing and going crazy, she remained demure."}, {"word": "denigrate", "sense": 1, "pos": "v.", "definition": "to belittle, diminish the opinion of", "example": "The company decided that its advertisements would no longer denigrate the company’s competitors."}, {"word": "denounce", "sense": 1, "pos": "v.", "definition": "to criticize publicly", "example": "The senator denounced her opponent as a greedy politician."}, {"word": "deplore", "sense": 1, "pos": "v.", "definition": "to feel or express sorrow, disapproval", "example": "We all deplored the miserable working conditions in the factory."}, {"word": "depravity", "sense": 1, "pos": "n.", "definition": "wickedness", "example": "Rumors of the ogre’s depravity made the children afraid to enter the forest."}, {"word": "deprecate", "sense": 1, "pos": "v.", "definition": "to belittle, depreciate", "example": "Always over-modest, he deprecated his contribution to the local charity."}, {"word": "derelict", "sense": 1, "pos": "adj.", "definition": "abandoned, run-down", "example": "Even though it was dangerous, the children enjoyed going to the deserted lot and playing in the derelict house."}, {"word": "deride", "sense": 1, "pos": "v.", "definition": "to laugh at mockingly, scorn", "example": "The bullies derided the foreign student’s accent."}, {"word": "derivative", "sense": 1, "pos": "adj.", "definition": "taken directly from a source, unoriginal", "example": "She was bored by his music because she felt that it was derivative and that she had heard it before."}, {"word": "desecrate", "sense": 1, "pos": "v.", "definition": "to violate the sacredness of a thing or place", "example": "They feared that the construction of a golf course would desecrate the preserved wilderness."}, {"word": "desiccated", "sense": 1, "pos": "adj.", "definition": "dried up, dehydrated", "example": "The skin of the desiccated mummy looked like old paper."}, {"word": "desolate", "sense": 1, "pos": "adj.", "definition": "deserted, dreary, lifeless (She found the desolate landscape quite a contrast to the hustle and bustle of the overcrowded city.) yralubacoV TAS", "example": ""}, {"word": "despondent", "sense": 1, "pos": "adj.", "definition": "feeling depressed, discouraged, hopeless", "example": "Having failed the first math test, the despondent child saw no use in studying for the next and failed that one too."}, {"word": "despot", "sense": 1, "pos": "n.", "definition": "one who has total power and rules brutally", "example": "The despot issued a death sentence for anyone who disobeyed his laws."}, {"word": "destitute", "sense": 1, "pos": "adj.", "definition": "impoverished, utterly lacking", "example": "The hurricane destroyed many homes and left many families destitute."}, {"word": "deter", "sense": 1, "pos": "v.", "definition": "to discourage, prevent from doing", "example": "Bob’s description of scary snakes couldn’t deter Marcia from traveling in the rainforests."}, {"word": "devious", "sense": 1, "pos": "adj.", "definition": "not straightforward, deceitful", "example": "Not wanting to be punished, the devious girl blamed the broken vase on the cat."}, {"word": "dialect", "sense": 1, "pos": "n.", "definition": "a variation of a language", "example": "In the country’s remote, mountainous regions, the inhabitants spoke a dialect that the country’s other inhabitants had difficulty understanding."}, {"word": "diaphanous", "sense": 1, "pos": "adj.", "definition": "light, airy, transparent", "example": "Sunlight poured in through the diaphanous curtains, brightening the room."}, {"word": "didactic", "sense": 1, "pos": "adj.", "definition": "intended to instruct", "example": "She wrote up a didactic document showing new employees how to handle the company’s customers."}, {"word": "didactic", "sense": 2, "pos": "adj.", "definition": "overly moralistic", "example": "His didactic style of teaching made it seem like he wanted to persuade his students not to understand history fully, but to understand it from only one point of view."}, {"word": "diffident", "sense": 1, "pos": "adj.", "definition": "shy, quiet, modest", "example": "While eating dinner with the adults, the diffident youth did not speak for fear of seeming presumptuous."}, {"word": "diffuse", "sense": 1, "pos": "v.", "definition": "to scatter, thin out, break up", "example": "He diffused the tension in the room by making in a joke."}, {"word": "diffuse", "sense": 2, "pos": "adj.", "definition": "not concentrated, scattered, disorganized", "example": "In her writings, she tried unsuccessfully to make others understand her diffuse thoughts."}, {"word": "dilatory", "sense": 1, "pos": "adj.", "definition": "tending to delay, causing delay", "example": "The general’s dilatory strategy enabled the enemy to regroup."}, {"word": "diligent", "sense": 1, "pos": "adj.", "definition": "showing care in doing one’s work", "example": "The diligent researcher made sure to check her measurements multiple times."}, {"word": "diminutive", "sense": 1, "pos": "adj.", "definition": "small or miniature", "example": "The bullies, tall and strong, picked on the diminutive child."}, {"word": "dirge", "sense": 1, "pos": "n.", "definition": "a mournful song, especially for a funeral (The bagpipers played a dirge as the casket was carried to the cemetery.) SAT Vocabulary", "example": ""}, {"word": "disaffected", "sense": 1, "pos": "adj.", "definition": "rebellious, resentful of authority", "example": "Dismayed by Bobby’s poor behavior, the parents sent their disaffected son to a military academy to be disciplined."}, {"word": "disavow", "sense": 1, "pos": "v.", "definition": "to deny knowledge of or responsibility for", "example": "Not wanting others to criticize her, she disavowed any involvement in the company’s hiring scandal."}, {"word": "discern", "sense": 1, "pos": "v.", "definition": "to perceive, detect", "example": "Though he hid his emotions, she discerned from his body language that he was angry."}, {"word": "disclose", "sense": 1, "pos": "v.", "definition": "to reveal, make public", "example": "The CEO disclosed to the press that the company would have to fire several employees."}, {"word": "discomfit", "sense": 1, "pos": "v.", "definition": "to thwart, baffle", "example": "The normally cheery and playful children’s sudden misery discomfited the teacher."}, {"word": "discordant", "sense": 1, "pos": "adj.", "definition": "not agreeing, not in harmony with", "example": "The girls’ sobs were a discordant sound amid the general laughter that filled the restaurant."}, {"word": "discrepancy", "sense": 1, "pos": "n.", "definition": "difference, failure of things to correspond", "example": "He was troubled by the discrepancy between what he remembered paying for the appliance and what his receipt showed he paid for it."}, {"word": "discretion", "sense": 1, "pos": "n.", "definition": "the quality of being reserved in speech or action; good judgment", "example": "Not wanting her patient to get overly anxious, the doctor used discretion in deciding how much to tell the patient about his condition."}, {"word": "discursive", "sense": 1, "pos": "adj.", "definition": "rambling, lacking order", "example": "The professor’s discursive lectures seemed to be about every subject except the one initially described."}, {"word": "disdain", "sense": 1, "pos": "v.", "definition": "to scorn, hold in low esteem", "example": "Insecure about their jobs, the older employees disdained the recently hired ones, who were young and capable."}, {"word": "disdain", "sense": 2, "pos": "n.", "definition": "scorn, low esteem", "example": "After learning of his immoral actions, Justine held Lawrence in disdain."}, {"word": "disgruntled", "sense": 1, "pos": "adj.", "definition": "upset, not content", "example": "The child believed that his parents had unjustly grounded him, and remained disgruntled for a week."}, {"word": "disheartened", "sense": 1, "pos": "adj.", "definition": "feeling a loss of spirit or morale", "example": "The team was disheartened after losing in the finals of the tournament."}, {"word": "disparage", "sense": 1, "pos": "v.", "definition": "to criticize or speak ill of", "example": "The saleswoman disparaged the competitor’s products to persuade her customers to buy what she was selling."}, {"word": "disparate", "sense": 1, "pos": "adj.", "definition": "sharply differing, containing sharply contrasting elements (Having widely varying interests, the students had disparate responses toward the novel.) yralubacoV TAS", "example": ""}, {"word": "dispatch", "sense": 1, "pos": "v.", "definition": "to send off to accomplish a duty", "example": "The carpenter dispatched his assistant to fetch wood."}, {"word": "dispel", "sense": 1, "pos": "v.", "definition": "to drive away, scatter", "example": "She entered the office as usual on Monday, dispelling the rumor that she had been fired."}, {"word": "disperse", "sense": 1, "pos": "v.", "definition": "to scatter, cause to scatter", "example": "When the rain began to pour, the crowd at the baseball game quickly dispersed."}, {"word": "disrepute", "sense": 1, "pos": "n.", "definition": "a state of being held in low regard", "example": "The officer fell into disrepute after it was learned that he had disobeyed the orders he had given to his own soldiers."}, {"word": "dissemble", "sense": 1, "pos": "v.", "definition": "to conceal, fake", "example": "Not wanting to appear heartlessly greedy, she dissembled and hid her intention to sell her ailing father’s stamp collection."}, {"word": "disseminate", "sense": 1, "pos": "v.", "definition": "to spread widely", "example": "The politician disseminated his ideas across the town before the election."}, {"word": "dissent", "sense": 1, "pos": "v.", "definition": "to disagree", "example": "The principal argued that the child should repeat the fourth grade, but the unhappy parents dissented."}, {"word": "dissent", "sense": 2, "pos": "n.", "definition": "the act of disagreeing", "example": "Unconvinced that the defendant was guilty, the last juror voiced his dissent with the rest of the jury."}, {"word": "dissipate", "sense": 1, "pos": "v.", "definition": "to disappear, cause to disappear", "example": "The sun finally came out and dissipated the haze."}, {"word": "dissipate", "sense": 2, "pos": "v.", "definition": "to waste", "example": "She dissipated her fortune on a series of bad investments."}, {"word": "dissonance", "sense": 1, "pos": "n.", "definition": "lack of harmony or consistency", "example": "Though the president of the company often spoke of the company as reliant solely upon its workers, her decision to increase her own salary rather than reward her employees revealed a striking dissonance between her alleged beliefs and her actions."}, {"word": "dissuade", "sense": 1, "pos": "v.", "definition": "to persuade someone not to do something", "example": "Worried that he would catch a cold, she tried to dissuade him from going out on winter nights."}, {"word": "distend", "sense": 1, "pos": "v.", "definition": "to swell out", "example": "Years of drinking beer caused his stomach to distend."}, {"word": "dither", "sense": 1, "pos": "v.", "definition": "to be indecisive", "example": "Not wanting to offend either friend, he dithered about which of the two birthday parties he should attend."}, {"word": "divine", "sense": 1, "pos": "adj.", "definition": "godly, exceedingly wonderful", "example": "Terribly fond of desserts, she found the rich chocolate cake to be divine."}, {"word": "divisive", "sense": 1, "pos": "adj.", "definition": "causing dissent, discord (Her divisive tactics turned her two friends against each other.) SAT Vocabulary", "example": ""}, {"word": "divulge", "sense": 1, "pos": "v.", "definition": "to reveal something secret", "example": "Pressured by the press, the government finally divulged the previously unknown information."}, {"word": "docile", "sense": 1, "pos": "adj.", "definition": "easily taught or trained", "example": "She successfully taught the docile puppy several tricks."}, {"word": "dogmatic", "sense": 1, "pos": "adj.", "definition": "aggressively and arrogantly certain about unproved principles", "example": "His dogmatic claim that men were better than women at fixing appliances angered everyone."}, {"word": "dormant", "sense": 1, "pos": "adj.", "definition": "sleeping, temporarily inactive", "example": "Though she pretended everything was fine, her anger lay dormant throughout the dinner party and exploded in screams of rage after everyone had left."}, {"word": "dour", "sense": 1, "pos": "adj.", "definition": "stern, joyless", "example": "The children feared their dour neighbor because the old man would take their toys if he believed they were being too loud."}, {"word": "dubious", "sense": 1, "pos": "adj.", "definition": "doubtful, of uncertain quality", "example": "Suspicious that he was only trying to get a raise, she found his praise dubious."}, {"word": "duplicity", "sense": 1, "pos": "n.", "definition": "crafty dishonesty", "example": "His duplicity involved convincing his employees to let him lower their salaries and increase their stock options, and then to steal the money he saved and run the company into the ground."}, {"word": "duress", "sense": 1, "pos": "n.", "definition": "hardship, threat", "example": "It was only under intense duress that he, who was normally against killing, fired his gun."}, {"word": "dynamic", "sense": 1, "pos": "adj.", "definition": "actively changing", "example": "The parents found it hard to keep up with the dynamic music scene with which their children had become very familiar."}, {"word": "ebullient", "sense": 1, "pos": "adj.", "definition": "extremely lively, enthusiastic", "example": "She became ebullient upon receiving an acceptance letter from her first-choice college."}, {"word": "eclectic", "sense": 1, "pos": "adj.", "definition": "consisting of a diverse variety of elements", "example": "That bar attracts an eclectic crowd: lawyers, artists, circus clowns, and investment bankers."}, {"word": "ecstatic", "sense": 1, "pos": "adj.", "definition": "intensely and overpoweringly happy", "example": "The couple was ecstatic when they learned that they had won the lottery."}, {"word": "edict", "sense": 1, "pos": "n.", "definition": "an order, decree (The ruler issued an edict requiring all of his subjects to bow down before him.) yralubacoV TAS", "example": ""}, {"word": "efface", "sense": 1, "pos": "v.", "definition": "to wipe out, obliterate, rub away", "example": "The husband was so angry at his wife for leaving him that he effaced all evidence of her presence; he threw out pictures of her and gave away all her belongings."}, {"word": "effervescent", "sense": 1, "pos": "adj.", "definition": "bubbly, lively", "example": "My friend is so effervescent that she makes everyone smile."}, {"word": "efficacious", "sense": 1, "pos": "adj.", "definition": "effective", "example": "My doctor promised me that the cold medicine was efficacious, but I’m still sniffling."}, {"word": "effrontery", "sense": 1, "pos": "n.", "definition": "impudence, nerve, insolence", "example": "When I told my aunt that she was boring, my mother scolded me for my effrontery."}, {"word": "effulgent", "sense": 1, "pos": "adj.", "definition": "radiant, splendorous", "example": "The golden palace was effulgent."}, {"word": "egregious", "sense": 1, "pos": "adj.", "definition": "extremely bad", "example": "The student who threw sloppy joes across the cafeteria was punished for his egregious behavior."}, {"word": "elaborate", "sense": 1, "pos": "adj.", "definition": "complex, detailed, intricate", "example": "Dan always beats me at chess because he develops such an elaborate game plan that I can never predict his next move."}, {"word": "elated", "sense": 1, "pos": "adj.", "definition": "overjoyed, thrilled", "example": "When she found out she had won the lottery, the writer was elated."}, {"word": "elegy", "sense": 1, "pos": "n.", "definition": "a speech given in honor of a dead person", "example": "At the funeral, the widow gave a moving elegy describing her love for her husband."}, {"word": "elicit", "sense": 1, "pos": "v.", "definition": "to bring forth, draw out, evoke", "example": "Although I asked several times where the exit was, I elicited no response from the stone-faced policeman."}, {"word": "eloquent", "sense": 1, "pos": "adj.", "definition": "expressive, articulate, moving", "example": "The priest gave such an eloquent sermon that most churchgoers were crying."}, {"word": "elucidate", "sense": 1, "pos": "v.", "definition": "to clarify, explain", "example": "I didn’t understand why my friend was so angry with me, so I asked Janine to elucidate her feelings."}, {"word": "elude", "sense": 1, "pos": "v.", "definition": "to evade, escape", "example": "Despite an intense search, the robber continues to elude the police."}, {"word": "emaciated", "sense": 1, "pos": "adj.", "definition": "very thin, enfeebled looking", "example": "My sister eats a lot of pastries and chocolate but still looks emaciated."}, {"word": "embellish", "sense": 1, "pos": "v.", "definition": "to decorate, adorn", "example": "My mom embellished the living room by adding lace curtains."}, {"word": "embellish", "sense": 2, "pos": "v.", "definition": "to add details to, enhance (When Harry told me that he had “done stuff” on his vacation, I asked him to embellish upon his account.) SAT Vocabulary", "example": ""}, {"word": "embezzle", "sense": 1, "pos": "v.", "definition": "to steal money by falsifying records", "example": "The accountant was fired for embezzling $10,000 of the company’s funds."}, {"word": "emend", "sense": 1, "pos": "v.", "definition": "to correct or revise a written text", "example": "If my sentence is incorrect, the editor will emend what I have written."}, {"word": "eminent", "sense": 1, "pos": "adj.", "definition": "distinguished, prominent, famous", "example": "Mr. Phillips is such an eminent scholar that every professor on campus has come to hear him lecture."}, {"word": "eminent", "sense": 2, "pos": "adj.", "definition": "", "example": ""}, {"word": "conspicuous", "sense": 1, "pos": "There is an eminent stain on that shirt.", "definition": "", "example": ""}, {"word": "emollient", "sense": 1, "pos": "adj.", "definition": "soothing", "example": "This emollient cream makes my skin very smooth."}, {"word": "emote", "sense": 1, "pos": "v.", "definition": "to express emotion", "example": "The director told the actor he had to emote, or else the audience would have no idea what his character was going through."}, {"word": "empathy", "sense": 1, "pos": "n.", "definition": "sensitivity to another’s feelings as if they were one’s own", "example": "I feel such empathy for my sister when she’s in pain that I cry too."}, {"word": "empirical", "sense": 1, "pos": "adj.", "definition": "based on observation or experience", "example": "The scientist gathered empirical data on the growth rate of dandelions by studying the dandelions behind his house."}, {"word": "empirical", "sense": 2, "pos": "adj.", "definition": "capable of being proved or disproved by experiment", "example": "That all cats hate getting wet is an empirical statement: I can test it by bathing my cat, Trinket."}, {"word": "emulate", "sense": 1, "pos": "v.", "definition": "to imitate", "example": "I idolize Britney Spears so much that I emulate everything she does: I wear her outfits, sing along to her songs, and date a boy named Justin."}, {"word": "enamor", "sense": 1, "pos": "v.", "definition": "to fill with love, fascinate, usually used in passive form followed by “of” or “with”", "example": "I grew enamored of that boy when he quoted my favorite love poem."}, {"word": "encore", "sense": 1, "pos": "n.", "definition": "the audience’s demand for a repeat performance; also the artist’s performance in response to that demand", "example": "At the end of the concert, all the fans yelled, “Encore! Encore!” but the band did not come out to play again."}, {"word": "encumber", "sense": 1, "pos": "v.", "definition": "to weigh down, burden", "example": "At the airport, my friend was encumbered by her luggage, so I offered to carry two of her bags."}, {"word": "enervate", "sense": 1, "pos": "v.", "definition": "to weaken, exhaust", "example": "Writing these sentences enervates me so much that I will have to take a nap after I finish."}, {"word": "enfranchise", "sense": 1, "pos": "v.", "definition": "to grant the vote to", "example": "The Nineteenth Amendment enfranchised women."}, {"word": "engender", "sense": 1, "pos": "v.", "definition": "to bring about, create, generate", "example": "During the Olympics, the victories of U.S. athletes engender a patriotic spirit among Americans."}, {"word": "enigmatic", "sense": 1, "pos": "adj.", "definition": "mystifying, cryptic (That man wearing the dark suit and dark glasses is so enigmatic that no one even knows his name.) yralubacoV TAS", "example": ""}, {"word": "enmity", "sense": 1, "pos": "n.", "definition": "ill will, hatred, hostility", "example": "Mark and Andy have clearly not forgiven each other, because the enmity between them is obvious to anyone in their presence."}, {"word": "ennui", "sense": 1, "pos": "n.", "definition": "boredom, weariness", "example": "I feel such ennui that I don’t look forward to anything, not even my birthday party."}, {"word": "entail", "sense": 1, "pos": "v.", "definition": "to include as a necessary step", "example": "Building a new fence entails tearing down the old one."}, {"word": "enthrall", "sense": 1, "pos": "v.", "definition": "to charm, hold spellbound", "example": "The sailor’s stories of fighting off sharks and finding ancient treasures enthralled his young son."}, {"word": "ephemeral", "sense": 1, "pos": "adj.", "definition": "short-lived, fleeting", "example": "She promised she’d love me forever, but her “forever” was only ephemeral: she left me after one week."}, {"word": "epistolary", "sense": 1, "pos": "adj.", "definition": "relating to or contained in letters", "example": "Some people call me “Auntie’s boy,” because my aunt and I have such a close epistolary relationship that we write each other every day."}, {"word": "epitome", "sense": 1, "pos": "n.", "definition": "a perfect example, embodiment", "example": "My mother, the epitome of good taste, always dresses more elegantly than I do."}, {"word": "equanimity", "sense": 1, "pos": "n.", "definition": "composure", "example": "Even though he had just been fired, Mr. Simms showed great equanimity by neatly packing up his desk and wishing everyone in the office well."}, {"word": "equivocal", "sense": 1, "pos": "adj.", "definition": "ambiguous, uncertain, undecided", "example": "His intentions were so equivocal that I didn’t know whether he was being chivalrous or sleazy."}, {"word": "erudite", "sense": 1, "pos": "adj.", "definition": "learned", "example": "My Latin teacher is such an erudite scholar that he has translated some of the most difficult and abstruse ancient poetry."}, {"word": "eschew", "sense": 1, "pos": "v.", "definition": "to shun, avoid", "example": "George hates the color green so much that he eschews all green food."}, {"word": "esoteric", "sense": 1, "pos": "adj.", "definition": "understood by only a select few", "example": "Even the most advanced students cannot understand the physicist’s esoteric theories."}, {"word": "espouse", "sense": 1, "pos": "v.", "definition": "to take up as a cause, support", "example": "I love animals so much that I espouse animal rights."}, {"word": "ethereal", "sense": 1, "pos": "adj.", "definition": "heavenly, exceptionally delicate or refined", "example": "In her flowing silk gown and lace veil, the bride looked ethereal."}, {"word": "etymology", "sense": 1, "pos": "n.", "definition": "the history of words, their origin and development (From the study of etymology, I know that the word “quixotic” derives from Don Quixote and the word “gaudy” refers to the Spanish architect Gaudí.) SAT Vocabulary", "example": ""}, {"word": "euphoric", "sense": 1, "pos": "adj.", "definition": "elated, uplifted", "example": "I was euphoric when I found out that my sister had given birth to twins."}, {"word": "evanescent", "sense": 1, "pos": "adj.", "definition": "fleeting, momentary", "example": "My joy at getting promoted was evanescent because I discovered that I would have to work much longer hours in a less friendly office."}, {"word": "evince", "sense": 1, "pos": "v.", "definition": "to show, reveal", "example": "Christopher’s hand-wringing and nail-biting evince how nervous he is about the upcoming English test."}, {"word": "exacerbate", "sense": 1, "pos": "v.", "definition": "to make more violent, intense", "example": "The gruesome and scary movie I saw last night exacerbated my fears of the dark."}, {"word": "exalt", "sense": 1, "pos": "v.", "definition": "to glorify, praise", "example": "Michael Jordan is the figure in basketball we exalt the most."}, {"word": "exasperate", "sense": 1, "pos": "v.", "definition": "to irritate, irk", "example": "George’s endless complaints exasperated his roomate."}, {"word": "excavate", "sense": 1, "pos": "v.", "definition": "to dig out of the ground and remove", "example": "The pharaoh’s treasures were excavated by archeologists in Egypt."}, {"word": "exculpate", "sense": 1, "pos": "v.", "definition": "to free from guilt or blame, exonerate", "example": "My discovery of the ring behind the dresser exculpated me from the charge of having stolen it."}, {"word": "excursion", "sense": 1, "pos": "n.", "definition": "a trip or outing", "example": "After taking an excursion to the Bronx Zoo, I dreamed about pandas and monkeys."}, {"word": "execrable", "sense": 1, "pos": "adj.", "definition": "loathsome, detestable", "example": "Her pudding is so execrable that it makes me sick."}, {"word": "exhort", "sense": 1, "pos": "v.", "definition": "to urge, prod, spur", "example": "Henry exhorted his colleagues to join him in protesting against the university’s hiring policies."}, {"word": "exigent", "sense": 1, "pos": "adj.", "definition": "urgent, critical", "example": "The patient has an exigent need for medication, or else he will lose his sight."}, {"word": "exonerate", "sense": 1, "pos": "v.", "definition": "to free from guilt or blame, exculpate", "example": "The true thief’s confession exonerated the man who had been held in custody for the crime."}, {"word": "exorbitant", "sense": 1, "pos": "adj.", "definition": "excessive", "example": "Her exorbitant praise made me blush and squirm in my seat."}, {"word": "expedient", "sense": 1, "pos": "adj.", "definition": "advisable, advantageous, serving one’s self-interest", "example": "In his bid for reelection, the governor made an expedient move by tabling all controversial legislation."}, {"word": "expiate", "sense": 1, "pos": "v.", "definition": "to make amends for, atone (To expiate my selfishness, I gave all my profits to charity.) yralubacoV TAS", "example": ""}, {"word": "expunge", "sense": 1, "pos": "v.", "definition": "to obliterate, eradicate", "example": "Fearful of an IRS investigation, Paul tried to expunge all incriminating evidence from his tax files."}, {"word": "expurgate", "sense": 1, "pos": "v.", "definition": "to remove offensive or incorrect parts, usually of a book", "example": "The history editors expurgated from the text all disparaging and inflammatory comments about the Republican Party."}, {"word": "extant", "sense": 1, "pos": "adj.", "definition": "existing, not destroyed or lost", "example": "My mother’s extant love letters to my father are in the attic trunk."}, {"word": "extol", "sense": 1, "pos": "v.", "definition": "to praise, revere", "example": "Violet extolled the virtues of a vegetarian diet to her meat- loving brother."}, {"word": "extraneous", "sense": 1, "pos": "adj.", "definition": "irrelevant, extra, not necessary", "example": "Personal political ambitions should always remain extraneous to legislative policy, but, unfortunately, they rarely are."}, {"word": "extricate", "sense": 1, "pos": "v.", "definition": "to disentangle", "example": "Instead of trying to mediate between my brother and sister, I extricated myself from the family tension entirely and left the house for the day."}, {"word": "exult", "sense": 1, "pos": "v.", "definition": "to rejoice", "example": "When she found out she won the literature prize, Mary exulted by dancing and singing through the school’s halls."}, {"word": "fabricate", "sense": 1, "pos": "v.", "definition": "to make up, invent", "example": "When I arrived an hour late to class, I fabricated some excuse about my car breaking down on the way to school."}, {"word": "façade", "sense": 1, "pos": "n.", "definition": "the wall of a building", "example": "Meet me in front of the museum’s main façade."}, {"word": "façade", "sense": 2, "pos": "n.", "definition": "a deceptive appearance or attitude", "example": "Despite my smiling façade, I am feeling melancholy."}, {"word": "facile", "sense": 1, "pos": "adj.", "definition": "easy, requiring little effort", "example": "This game is so facile that even a four-year- old can master it."}, {"word": "facile", "sense": 2, "pos": "adj.", "definition": "superficial, achieved with minimal thought or care, insincere", "example": "The business was in such shambles that any solution seemed facile at best; nothing could really helpit in the long-run."}, {"word": "fallacious", "sense": 1, "pos": "adj.", "definition": "incorrect, misleading", "example": "Emily offered me cigarettes on the fallacious assumption that I smoked."}, {"word": "fastidious", "sense": 1, "pos": "adj.", "definition": "meticulous, demanding, having high and often unattainable standards", "example": "Mark is so fastidious that he is never able to finish a project because it always seems imperfect to him."}, {"word": "fathom", "sense": 1, "pos": "v.", "definition": "to understand, comprehend (I cannot fathom why you like that crabby and mean-spirited neighbor of ours.) SAT Vocabulary", "example": ""}, {"word": "fatuous", "sense": 1, "pos": "adj.", "definition": "silly, foolish", "example": "He considers himself a serious poet, but in truth, he only writes fatuous limericks."}, {"word": "fecund", "sense": 1, "pos": "adj.", "definition": "fruitful, fertile", "example": "The fecund tree bore enough apples to last us through the entire season."}, {"word": "felicitous", "sense": 1, "pos": "adj.", "definition": "well suited, apt", "example": "While his comments were idiotic and rambling, mine were felicitous and helpful."}, {"word": "felicitous", "sense": 2, "pos": "adj.", "definition": "delightful, pleasing", "example": "I spent a felicitous afternoon visiting old friends."}, {"word": "feral", "sense": 1, "pos": "adj.", "definition": "wild, savage", "example": "That beast looks so feral that I would fear being alone with it."}, {"word": "fervent", "sense": 1, "pos": "adj.", "definition": "ardent, passionate", "example": "The fervent protestors chained themselves to the building and shouted all night long."}, {"word": "fetid", "sense": 1, "pos": "adj.", "definition": "having a foul odor", "example": "I can tell from the fetid smell in your refrigerator that your milk has spoiled."}, {"word": "fetter", "sense": 1, "pos": "v.", "definition": "to chain, restrain", "example": "The dog was fettered to the parking meter."}, {"word": "fickle", "sense": 1, "pos": "adj.", "definition": "shifting in character, inconstant", "example": "In Greek dramas, the fickle gods help Achilles one day, and then harm him the next."}, {"word": "fidelity", "sense": 1, "pos": "n.", "definition": "loyalty, devotion", "example": "Guard dogs are known for the great fidelity they show toward their masters."}, {"word": "figurative", "sense": 1, "pos": "adj.", "definition": "symbolic", "example": "Using figurative language, Jane likened the storm to an angry bull."}, {"word": "flabbergasted", "sense": 1, "pos": "adj.", "definition": "astounded", "example": "Whenever I read an Agatha Christie mystery novel, I am always flabbergasted when I learn the identity of the murderer."}, {"word": "flaccid", "sense": 1, "pos": "adj.", "definition": "limp, not firm or strong", "example": "If a plant is not watered enough, its leaves become droopy and flaccid."}, {"word": "flagrant", "sense": 1, "pos": "adj.", "definition": "offensive, egregious", "example": "The judge’s decision to set the man free simply because that man was his brother was a flagrant abuse of power."}, {"word": "florid", "sense": 1, "pos": "adj.", "definition": "flowery, ornate", "example": "The writer’s florid prose belongs on a sentimental Hallmark card."}, {"word": "flout", "sense": 1, "pos": "v.", "definition": "to disregard or disobey openly", "example": "I flouted the school’s dress code by wearing a tie-dyed tank top and a pair of cut-off jeans."}, {"word": "foil", "sense": 1, "pos": "v.", "definition": "to thwart, frustrate, defeat (Inspector Wilkens foiled the thieves by locking them in the bank along with their stolen money.) yralubacoV TAS", "example": ""}, {"word": "forage", "sense": 1, "pos": "v.", "definition": "to graze, rummage for food", "example": "When we got lost on our hiking trip, we foraged for berries and nuts in order to survive."}, {"word": "forbearance", "sense": 1, "pos": "n.", "definition": "patience, restraint, toleration", "example": "The doctor showed great forbearance in calming down the angry patient who shouted insults at him."}, {"word": "forestall", "sense": 1, "pos": "v.", "definition": "to prevent, thwart, delay", "example": "I forestalled the cold I was getting by taking plenty of vitamin C pills and wearing a scarf."}, {"word": "forlorn", "sense": 1, "pos": "adj.", "definition": "lonely, abandoned, hopeless", "example": "Even though I had the flu, my family decided to go skiing for the weekend and leave me home alone, feeling feverish and forlorn."}, {"word": "forsake", "sense": 1, "pos": "v.", "definition": "to give up, renounce", "example": "My New Year’s resolution is to forsake smoking and drinking."}, {"word": "fortitude", "sense": 1, "pos": "n.", "definition": "strength, guts", "example": "Achilles’ fortitude in battle is legendary."}, {"word": "fortuitous", "sense": 1, "pos": "adj.", "definition": "happening by chance, often lucky or fortunate", "example": "After looking for Manuel and not finding him at home, Harriet had a fortuitous encounter with him at the post office."}, {"word": "forum", "sense": 1, "pos": "n.", "definition": "a medium for lecture or discussion", "example": "Some radio talk-shows provide a good forum for political debate."}, {"word": "foster", "sense": 1, "pos": "v.", "definition": "to stimulate, promote, encourage", "example": "To foster good health in the city, the mayor started a “Get out and exercise!” campaign."}, {"word": "fractious", "sense": 1, "pos": "adj.", "definition": "troublesome or irritable", "example": "Although the child insisted he wasn’t tired, his fractious behavior—especially his decision to crush his cheese and crackers all over the floor—convinced everyone present that it was time to put him to bed."}, {"word": "fraught", "sense": 1, "pos": "adj.", "definition": "(usually used with “with”) filled or accompanied with", "example": "Her glances in his direction were fraught with meaning, though precisely what meaning remained unclear."}, {"word": "frenetic", "sense": 1, "pos": "adj.", "definition": "frenzied, hectic, frantic", "example": "In the hours between night and morning, the frenetic pace of city life slows to a lull."}, {"word": "frivolous", "sense": 1, "pos": "adj.", "definition": "of little importance, trifling", "example": "Someday, all that anxiety about whether your zit will disappear before the prom will seem totally frivolous."}, {"word": "frugal", "sense": 1, "pos": "adj.", "definition": "thrifty, economical (Richard is so frugal that his diet consists almost exclusively of catfish and chicken liver—the two most inexpensive foods in the store.) SAT Vocabulary", "example": ""}, {"word": "furtive", "sense": 1, "pos": "adj.", "definition": "secretive, sly", "example": "Jane’s placement of her drugs in her sock drawer was not as furtive as she thought, as the sock drawer is the first place most parents look."}, {"word": "garish", "sense": 1, "pos": "adj.", "definition": "gaudy, in bad taste", "example": "Mrs. Watson has poor taste and covers every object in her house with a garish gold lamé."}, {"word": "garrulous", "sense": 1, "pos": "adj.", "definition": "talkative, wordy", "example": "Some talk show hosts are so garrulous that their guests can’t get a word in edgewise."}, {"word": "genial", "sense": 1, "pos": "adj.", "definition": "friendly, affable", "example": "Although he’s been known to behave like a real jerk, I would say that my brother is an overall genial guy."}, {"word": "gluttony", "sense": 1, "pos": "n.", "definition": "overindulgence in food or drink", "example": "Ada’s fried chicken tastes so divine, I don’t know how anyone can call gluttony a sin."}, {"word": "goad", "sense": 1, "pos": "v.", "definition": "to urge, spur, incite to action", "example": "Jim may think he’s not going to fight Billy, but Billy will goad Jim on with insults until he throws a punch."}, {"word": "gourmand", "sense": 1, "pos": "n.", "definition": "someone fond of eating and drinking", "example": "My parents, who used to eat little more than crackers and salad, have become real gourmands in their old age."}, {"word": "grandiloquence", "sense": 1, "pos": "n.", "definition": "lofty, pompous language", "example": "The student thought her grandiloquence would make her sound smart, but neither the class nor the teacher bought it."}, {"word": "grandiose", "sense": 1, "pos": "adj.", "definition": "on a magnificent or exaggerated scale", "example": "Margaret planned a grandiose party, replete with elephants, trapeze artists, and clowns."}, {"word": "gratuitous", "sense": 1, "pos": "adj.", "definition": "uncalled for, unwarranted", "example": "Every morning the guy at the donut shop gives me a gratuitous helping of ketchup packets."}, {"word": "gregarious", "sense": 1, "pos": "adj.", "definition": "drawn to the company of others, sociable", "example": "Well, if you’re not gregarious, I don’t know why you would want to go to a singles party!"}, {"word": "grievous", "sense": 1, "pos": "adj.", "definition": "injurious, hurtful; serious or grave in nature", "example": "Electrocuting the inmate without being sure of his guilt would be a truly grievous mistake."}, {"word": "guile", "sense": 1, "pos": "n.", "definition": "deceitful, cunning, sly behavior", "example": "Because of his great guile, the politician was able to survive scandal after scandal."}, {"word": "hackneyed", "sense": 1, "pos": "adj.", "definition": "unoriginal, trite (A girl can only hear “I love you” so many times before it begins to sound hackneyed and meaningless.) yralubacoV TAS", "example": ""}, {"word": "hallowed", "sense": 1, "pos": "adj.", "definition": "revered, consecrated", "example": "In the hallowed corridors of the cathedral, the disturbed professor felt himself to be at peace."}, {"word": "hapless", "sense": 1, "pos": "adj.", "definition": "unlucky", "example": "My poor, hapless family never seems to pick a sunny week to go on vacation."}, {"word": "harangue", "sense": 1, "pos": "n.", "definition": "a ranting speech", "example": "Everyone had heard the teacher’s harangue about gum chewing in class before."}, {"word": "harangue", "sense": 2, "pos": "v.", "definition": "to give such a speech", "example": "But this time the teacher harangued the class about the importance of brushing your teeth after chewing gum."}, {"word": "hardy", "sense": 1, "pos": "adj.", "definition": "robust, capable of surviving through adverse conditions", "example": "I too would have expected the plants to be dead by mid-November, but apparently they’re very hardy."}, {"word": "harrowing", "sense": 1, "pos": "adj.", "definition": "greatly distressing, vexing", "example": "The car crash was a harrowing experience, but I have a feeling that the increase in my insurance premiums will be even more upsetting."}, {"word": "haughty", "sense": 1, "pos": "adj.", "definition": "disdainfully proud", "example": "The superstar’s haughty dismissal of her costars will backfire on her someday."}, {"word": "hedonist", "sense": 1, "pos": "n.", "definition": "one who believes pleasure should be the primary pursuit of humans", "example": "Because he’s such a hedonist, I knew Murray would appreciate the 11 cases of wine I bought him for his birthday."}, {"word": "hegemony", "sense": 1, "pos": "n.", "definition": "domination over others", "example": "Britain’s hegemony over its colonies was threatened once nationalist sentiment began to spread around the world."}, {"word": "heinous", "sense": 1, "pos": "adj.", "definition": "shockingly wicked, repugnant", "example": "The killings were made all the more heinous by the fact that the murderer first tortured his victims for three days."}, {"word": "heterogeneous", "sense": 1, "pos": "adj.", "definition": "varied, diverse in character", "example": "I hate having only one flavor so I always buy the swirled, or should I say heterogeneous, type of ice cream."}, {"word": "hiatus", "sense": 1, "pos": "n.", "definition": "a break or gap in duration or continuity", "example": "The hiatus in service should last two or three months—until the cable lines are repaired ."}, {"word": "hierarchy", "sense": 1, "pos": "n.", "definition": "a system with ranked groups, usually according to social, economic, or professional class", "example": "Women found it very difficult to break into the upper ranks of the department’s hierarchy."}, {"word": "hypocrisy", "sense": 1, "pos": "n.", "definition": "pretending to believe what one does not (Once the politician began passing legislation that contradicted his campaign promises, his hypocrisy became apparent.) SAT Vocabulary", "example": ""}, {"word": "hypothetical", "sense": 1, "pos": "adj.", "definition": "supposed or assumed true, but unproven", "example": "Even though it has been celebrated by seven major newspapers, that the drug will be a success when tested in humans is still hypothetical."}, {"word": "iconoclast", "sense": 1, "pos": "n.", "definition": "one who attacks common beliefs or institutions", "example": "Jane goes to one protest after another, but she seems to be an iconoclast rather than an activist with a progressive agenda."}, {"word": "idiosyncratic", "sense": 1, "pos": "adj.", "definition": "peculiar to one person; highly individualized", "example": "I know you had trouble with the last test, but because your mistakes were highly idiosyncratic, I’m going to deny your request that the class be given a new test."}, {"word": "idolatrous", "sense": 1, "pos": "adj.", "definition": "excessively worshipping one object or person", "example": "Xena’s idolatrous fawning over the band—following them on tour, starting their fan club, filming their documentary—is really beginning to get on my nerves."}, {"word": "ignominious", "sense": 1, "pos": "adj.", "definition": "humiliating, disgracing", "example": "It was really ignominious to be kicked out of the dorm for having an illegal gas stove in my room."}, {"word": "illicit", "sense": 1, "pos": "adj.", "definition": "forbidden, not permitted", "example": "The fourth-grader learned many illicit words from a pamphlet that was being passed around school."}, {"word": "immerse", "sense": 1, "pos": "v.", "definition": "to absorb, deeply involve, engross", "example": "After breaking up with her boyfriend, Nancy decided to immerse herself in her work in order to avoid crying."}, {"word": "immutable", "sense": 1, "pos": "adj.", "definition": "not changeable", "example": "The laws of physics are immutable and constant."}, {"word": "impassive", "sense": 1, "pos": "adj.", "definition": "stoic, not susceptible to suffering", "example": "Stop being so impassive; it’s healthy to cry every now and then."}, {"word": "impeccable", "sense": 1, "pos": "adj.", "definition": "exemplary, flawless", "example": "If your grades were as impeccable as your sister’s, then you too would receive a car for a graduation present."}, {"word": "impecunious", "sense": 1, "pos": "adj.", "definition": "poor", "example": "“I fear he’s too impecunious to take me out tonight,” the bratty girl whined."}, {"word": "imperative", "sense": 1, "pos": "adj.", "definition": "necessary, pressing", "example": "It is imperative that you have these folders organized by midday."}, {"word": "imperative", "sense": 2, "pos": "n.", "definition": "a rule, command, or order", "example": "Her imperative to have the folders organized by midday was perceived as ridiculous by the others."}, {"word": "imperious", "sense": 1, "pos": "adj.", "definition": "commanding, domineering (The imperious nature of your manner led me to dislike you at once.) yralubacoV TAS", "example": ""}, {"word": "impertinent", "sense": 1, "pos": "adj.", "definition": "rude, insolent", "example": "Most of your comments are so impertinent that I don’t wish to dignify them with an answer."}, {"word": "impervious", "sense": 1, "pos": "adj.", "definition": "impenetrable, incapable of being affected", "example": "Because of their thick layer of fur, many seals are almost impervious to the cold."}, {"word": "impetuous", "sense": 1, "pos": "adj.", "definition": "rash; hastily done", "example": "Hilda’s hasty slaying of the king was an impetuous, thoughtless action."}, {"word": "impinge", "sense": 1, "pos": "v.", "definition": "to impact, affect, make an impression", "example": "The hail impinged the roof, leaving large dents."}, {"word": "impinge", "sense": 2, "pos": "v.", "definition": "to encroach, infringe", "example": "I apologize for impinging upon you like this, but I really need to use your bathroom. Now."}, {"word": "implacable", "sense": 1, "pos": "adj.", "definition": "incapable of being appeased or mitigated", "example": "Watch out: once you shun Grandma’s cooking, she is totally implacable."}, {"word": "implement", "sense": 1, "pos": "n.", "definition": "an instrument, utensil, tool", "example": "Do you have a knife or some other sort of implement that I could use to pry the lid off of this jar?"}, {"word": "implement", "sense": 2, "pos": "v.", "definition": "to put into effect, to institute", "example": "After the first town curfew failed to stop the graffiti problem, the mayor implemented a new policy to use security cameras to catch perpetrators in the act."}, {"word": "implicate", "sense": 1, "pos": "v.", "definition": "to involve in an incriminating way, incriminate", "example": "Even though Tom wasn’t present at the time of the shooting, he was implicated by the evidence suggesting that he had supplied the shooters with guns."}, {"word": "implicit", "sense": 1, "pos": "adj.", "definition": "understood but not outwardly obvious, implied", "example": "I know Professor Smith didn’t actually say not to write from personal experience, but I think such a message was implicit in her instruction to use scholarly sources."}, {"word": "impregnable", "sense": 1, "pos": "adj.", "definition": "resistant to capture or penetration", "example": "Though the invaders used battering rams, catapults, and rain dances, the fortress proved impregnable and resisted all attacks."}, {"word": "impudent", "sense": 1, "pos": "adj.", "definition": "casually rude, insolent, impertinent", "example": "The impudent young man looked the princess up and down and told her she was hot even though she hadn’t asked him."}, {"word": "impute", "sense": 1, "pos": "v.", "definition": "to ascribe, blame", "example": "The CEO imputed the many typos in the letter to his lazy secretary."}, {"word": "inane", "sense": 1, "pos": "adj.", "definition": "silly and meaningless", "example": "Some films are so inane that the psychology of the characters makes absolutely no sense."}, {"word": "inarticulate", "sense": 1, "pos": "adj.", "definition": "incapable of expressing oneself clearly through speech (Though he spoke for over an hour, the lecturer was completely inarticulate and the students had no idea what he was talking about.) SAT Vocabulary", "example": ""}, {"word": "incarnate", "sense": 1, "pos": "adj.", "definition": "existing in the flesh, embodied", "example": "In the church pageant, I play the role of greed incarnate."}, {"word": "incarnate", "sense": 2, "pos": "v.", "definition": "to give human form to", "example": "The alien evaded detection by incarnating himself in a human form."}, {"word": "incendiary", "sense": 1, "pos": "n.", "definition": "a person who agitates", "example": "If we catch the incendiary who screamed “bomb” in the middle of the soccer match, we’re going to put him in jail."}, {"word": "incendiary", "sense": 2, "pos": "adj.", "definition": "inflammatory, causing combustion", "example": "Gas and lighter fluid are incendiary materials that should be kept out of hot storage areas."}, {"word": "incessant", "sense": 1, "pos": "adj.", "definition": "unending", "example": "We wanted to go outside and play, but the incessant rain kept us indoors for two days."}, {"word": "inchoate", "sense": 1, "pos": "adj.", "definition": "unformed or formless, in a beginning stage", "example": "The country’s government is still inchoate and, because it has no great tradition, quite unstable."}, {"word": "incisive", "sense": 1, "pos": "adj.", "definition": "clear, sharp, direct", "example": "The discussion wasn’t going anywhere until her incisive comment allowed everyone to see what the true issues were."}, {"word": "inclination", "sense": 1, "pos": "n.", "definition": "a tendency, propensity", "example": "Sarah has an inclination to see every foreign film she hears about, even when she’s sure that she won’t like it."}, {"word": "incontrovertible", "sense": 1, "pos": "adj.", "definition": "indisputable", "example": "Only stubborn Tina would attempt to disprove the incontrovertible laws of physics."}, {"word": "incorrigible", "sense": 1, "pos": "adj.", "definition": "incapable of correction, delinquent", "example": "You can buy Grandma nicotine gum all you want, but I think that after sixty-five years of smoking she’s incorrigible."}, {"word": "increment", "sense": 1, "pos": "n.", "definition": "an enlargement; the process of increasing", "example": "The workmen made the wall longer, increment by increment."}, {"word": "incumbent", "sense": 1, "pos": "n.", "definition": "one who holds an office", "example": "The incumbent senator is already serving his fifth term."}, {"word": "incumbent", "sense": 2, "pos": "adj.", "definition": "obligatory", "example": "It is incumbent upon this organization to offer aid to all who seek it."}, {"word": "indefatigable", "sense": 1, "pos": "adj.", "definition": "incapable of defeat, failure, decay", "example": "Even after traveling 62 miles, the indefatigable runner kept on moving."}, {"word": "indigenous", "sense": 1, "pos": "adj.", "definition": "originating in a region", "example": "Some fear that these plants, which are not indigenous to the region, may choke out the vegetation that is native to the area."}, {"word": "indigent", "sense": 1, "pos": "adj.", "definition": "very poor, impoverished", "example": "I would rather donate money to help the indigent population than to the park sculpture fund."}, {"word": "indignation", "sense": 1, "pos": "n.", "definition": "anger sparked by something unjust or unfair (I resigned from the sorority because of my indignation at its hazing of new members.) yralubacoV TAS", "example": ""}, {"word": "indolent", "sense": 1, "pos": "adj.", "definition": "lazy", "example": "Why should my indolent children, who can’t even pick themselves up off the couch to pour their own juice, be rewarded with a trip to the mall?"}, {"word": "indomitable", "sense": 1, "pos": "adj.", "definition": "not capable of being conquered", "example": "To be honest, Jim, my indomitable nature means I could never take orders from anyone, and especially not from a jerk like you."}, {"word": "induce", "sense": 1, "pos": "v.", "definition": "to bring about, stimulate", "example": "Who knew that our decision to boycott school lunch would induce a huge riot?"}, {"word": "ineffable", "sense": 1, "pos": "adj.", "definition": "unspeakable, incapable of being expressed through words", "example": "It is said that the experience of playing with a dolphin is ineffable and can only be understood through direct encounter."}, {"word": "inept", "sense": 1, "pos": "adj.", "definition": "not suitable or capable, unqualified", "example": "She proved how inept she was when she forgot three orders and spilled a beer in a customer’s lap."}, {"word": "inexorable", "sense": 1, "pos": "adj.", "definition": "incapable of being persuaded or placated", "example": "Although I begged for hours, Mom was inexorable and refused to let me stay out all night after the prom."}, {"word": "inextricable", "sense": 1, "pos": "adj.", "definition": "hopelessly tangled or entangled", "example": "Unless I look at the solution manual, I have no way of solving this inextricable problem."}, {"word": "infamy", "sense": 1, "pos": "n.", "definition": "notoriety, extreme ill repute", "example": "The infamy of his crime will not lessen as the decades pass."}, {"word": "infusion", "sense": 1, "pos": "n.", "definition": "an injection of one substance into another; the permeation of one substance by another", "example": "The infusion of Eastern religion into Western philosophy created interesting new schools of thought."}, {"word": "ingenious", "sense": 1, "pos": "adj.", "definition": "clever, resourceful", "example": "Her ingenious use of walnuts instead of the peanuts called for by the recipe was lauded by the other garden club members who found her cake delicious."}, {"word": "ingenuous", "sense": 1, "pos": "adj.", "definition": "not devious; innocent and candid", "example": "He must have writers, but his speeches seem so ingenuous it’s hard to believe he’s not speaking from his own heart."}, {"word": "inhibit", "sense": 1, "pos": "v.", "definition": "to prevent, restrain, stop", "example": "When I told you I needed the car last night, I certainly never meant to inhibit you from going out."}, {"word": "inimical", "sense": 1, "pos": "adj.", "definition": "hostile, enemylike", "example": "I don’t see how I could ever work for a company that was so cold and inimical to me during my interviews."}, {"word": "iniquity", "sense": 1, "pos": "n.", "definition": "wickedness or sin (“Your iniquity,” said the priest to the practical jokester, “will be forgiven.”) SAT Vocabulary", "example": ""}, {"word": "injunction", "sense": 1, "pos": "n.", "definition": "an order of official warning", "example": "After his house was toilet-papered for the fifth time, the mayor issued an injunction against anyone younger than 21 buying toilet paper."}, {"word": "innate", "sense": 1, "pos": "adj.", "definition": "inborn, native, inherent", "example": "His incredible athletic talent is innate, he never trains, lifts weights, or practices."}, {"word": "innocuous", "sense": 1, "pos": "adj.", "definition": "harmless, inoffensive", "example": "In spite of their innocuous appearance, these mushrooms are actually quite poisonous."}, {"word": "innovate", "sense": 1, "pos": "v.", "definition": "to do something in an unprecedented way", "example": "Because of the stiff competition, the company knew it needed to pour a lot of energy into innovating new and better products."}, {"word": "innuendo", "sense": 1, "pos": "n.", "definition": "an insinuation", "example": "During the debate, the politician made several innuendos about the sexual activities of his opponent."}, {"word": "inoculate", "sense": 1, "pos": "v.", "definition": "to introduce a microorganism, serum, or vaccine into an organism in order to increase immunity to illness; to vaccinate", "example": "I’ve feared needles ever since I was inoculated against 37 diseases at age one; but I have also never been sick."}, {"word": "inquisitor", "sense": 1, "pos": "n.", "definition": "one who inquires, especially in a hostile manner", "example": "The inquisitor was instructed to knock on every door in town in order to find the fugitive."}, {"word": "insatiable", "sense": 1, "pos": "adj.", "definition": "incapable of being satisfied", "example": "My insatiable appetite for melons can be a real problem in the winter."}, {"word": "insidious", "sense": 1, "pos": "adj.", "definition": "appealing but imperceptibly harmful, seductive", "example": "Lisa’s insidious chocolate cake tastes so good but makes you feel so sick later on!"}, {"word": "insinuate", "sense": 1, "pos": "v.", "definition": "to suggest indirectly or subtly", "example": "I wish Luke and Spencer would stop insinuating that my perfect report card is the result of anything other than my superior intelligence and good work habits."}, {"word": "insipid", "sense": 1, "pos": "adj.", "definition": "dull, boring", "example": "The play was so insipid, I fell asleep halfway through."}, {"word": "insolent", "sense": 1, "pos": "adj.", "definition": "rude, arrogant, overbearing", "example": "That celebrity is so insolent, making fun of his fans right to their faces."}, {"word": "instigate", "sense": 1, "pos": "v.", "definition": "to urge, goad", "example": "The demagogue instigated the crowd into a fury by telling them that they had been cheated by the federal government."}, {"word": "insular", "sense": 1, "pos": "adj.", "definition": "separated and narrow-minded; tight-knit, closed off (Because of the sensitive nature of their jobs, those who work for the CIA must remain insular and generally only spend time with each other.) yralubacoV TAS", "example": ""}, {"word": "insurgent", "sense": 1, "pos": "n.", "definition": "one who rebels", "example": "The insurgent snuck into and defaced a different classroom each night until the administration agreed to meet his demands."}, {"word": "integral", "sense": 1, "pos": "adj.", "definition": "necessary for completeness", "example": "Without the integral ingredient of flour, you wouldn’t be able to make bread."}, {"word": "interject", "sense": 1, "pos": "v.", "definition": "to insert between other things", "example": "During our conversation, the cab driver occasionally interjected his opinion."}, {"word": "interlocutor", "sense": 1, "pos": "n.", "definition": "someone who participates in a dialogue or conversation", "example": "When the officials could not come to an agreement over the correct cover of the flags, the prime minister acted as an interlocutor."}, {"word": "interminable", "sense": 1, "pos": "adj.", "definition": "without possibility of end", "example": "The fact that biology lectures came just before lunch made them seem interminable."}, {"word": "intimation", "sense": 1, "pos": "n.", "definition": "an indirect suggestion", "example": "Mr. Brinford’s intimation that he would soon pass away occurred when he began to discuss how to distribute his belongings among his children."}, {"word": "intractable", "sense": 1, "pos": "adj.", "definition": "difficult to manipulate, unmanageable", "example": "There was no end in sight to the intractable conflict between the warring countries."}, {"word": "intransigent", "sense": 1, "pos": "adj.", "definition": "refusing to compromise, often on an extreme opinion", "example": "The intransigent child said he would have 12 scoops of ice cream, or he would bang his head against the wall until his mother fainted from fear."}, {"word": "intrepid", "sense": 1, "pos": "adj.", "definition": "brave in the face of danger", "example": "After scaling a live volcano prior to its eruption, the explorer was praised for his intrepid attitude."}, {"word": "inundate", "sense": 1, "pos": "v.", "definition": "to flood with abundance", "example": "Because I am the star of a new sitcom, my fans are sure to inundate me with fan mail and praise."}, {"word": "inure", "sense": 1, "pos": "v.", "definition": "to cause someone or something to become accustomed to a situation", "example": "Twenty years in the salt mines inured the man to the discomforts of dirt and grime."}, {"word": "invective", "sense": 1, "pos": "n.", "definition": "an angry verbal attack", "example": "My mother’s irrational invective against the way I dress only made me decide to dye my hair green."}, {"word": "inveterate", "sense": 1, "pos": "adj.", "definition": "stubbornly established by habit", "example": "I’m the first to admit that I’m an inveterate coffee drinker—I drink four cups a day."}, {"word": "inviolable", "sense": 1, "pos": "adj.", "definition": "secure from assault", "example": "Nobody was ever able to break into Batman’s inviolable Batcave."}, {"word": "irascible", "sense": 1, "pos": "adj.", "definition": "easily angered (At the smallest provocation, my irascible cat will begin scratching and clawing.) SAT Vocabulary", "example": ""}, {"word": "iridescent", "sense": 1, "pos": "adj.", "definition": "showing rainbow colors", "example": "The bride’s large diamond ring was iridescent in the afternoon sun."}, {"word": "irreverence", "sense": 1, "pos": "n.", "definition": "disrespect", "example": "The irreverence displayed by the band that marched through the chapel disturbed many churchgoers."}, {"word": "irrevocable", "sense": 1, "pos": "adj.", "definition": "incapable of being taken back", "example": "The Bill of Rights is an irrevocable part of American law."}, {"word": "jubilant", "sense": 1, "pos": "adj.", "definition": "extremely joyful, happy", "example": "The crowd was jubilant when the firefighter carried the woman from the flaming building."}, {"word": "judicious", "sense": 1, "pos": "adj.", "definition": "having or exercising sound judgment", "example": "When the judicious king decided to compromise rather than send his army to its certain death, he was applauded."}, {"word": "juxtaposition", "sense": 1, "pos": "n.", "definition": "the act of placing two things next to each other for implicit comparison", "example": "The interior designer admired my juxtaposition of the yellow couch and green table."}, {"word": "knell", "sense": 1, "pos": "n.", "definition": "the solemn sound of a bell, often indicating a death", "example": "Echoing throughout our village, the funeral knell made the stormy day even more grim."}, {"word": "kudos", "sense": 1, "pos": "n.", "definition": "praise for an achievement", "example": "After the performance, the reviewers gave the opera singer kudos for a job well done."}, {"word": "laceration", "sense": 1, "pos": "n.", "definition": "a cut, tear", "example": "Because he fell off his bike into a rosebush, the paperboy’s skin was covered with lacerations."}, {"word": "laconic", "sense": 1, "pos": "adj.", "definition": "terse in speech or writing", "example": "The author’s laconic style has won him many followers who dislike wordiness."}, {"word": "languid", "sense": 1, "pos": "adj.", "definition": "sluggish from fatigue or weakness", "example": "In the summer months, the great heat makes people languid and lazy."}, {"word": "larceny", "sense": 1, "pos": "n.", "definition": "obtaining another’s property by theft or trickery", "example": "When my car was not where I had left it, I realized that I was a victim of larceny."}, {"word": "largess", "sense": 1, "pos": "n.", "definition": "the generous giving of lavish gifts (My boss demonstrated great largess by giving me a new car.) yralubacoV TAS", "example": ""}, {"word": "latent", "sense": 1, "pos": "adj.", "definition": "hidden, but capable of being exposed", "example": "Sigmund’s dream represented his latent paranoid obsession with other people’s shoes."}, {"word": "laudatory", "sense": 1, "pos": "adj.", "definition": "expressing admiration or praise", "example": "Such laudatory comments are unusual from someone who is usually so reserved in his opinions."}, {"word": "lavish", "sense": 1, "pos": "adj.", "definition": "given without limits", "example": "Because they had worked very hard, the performers appreciated the critic’s lavish praise."}, {"word": "lavish", "sense": 2, "pos": "v.", "definition": "to give without limits", "example": "Because the performers had worked hard, they deserved the praise that the critic lavished on them."}, {"word": "legerdemain", "sense": 1, "pos": "n.", "definition": "deception, slight-of-hand", "example": "Smuggling the French plants through customs by claiming that they were fake was a remarkable bit of legerdemain."}, {"word": "lenient", "sense": 1, "pos": "adj.", "definition": "demonstrating tolerance or gentleness", "example": "Because Professor Oglethorpe allowed his students to choose their final grades, the other teachers believed that he was excessively lenient."}, {"word": "lethargic", "sense": 1, "pos": "adj.", "definition": "in a state of sluggishness or apathy", "example": "When Jean Claude explained to his boss that he was lethargic and didn’t feel like working that day, the boss fired him."}, {"word": "liability", "sense": 1, "pos": "n.", "definition": "something for which one is legally responsible, usually involving a disadvantage or risk", "example": "The bungee-jumping tower was a great liability for the owners of the carnival."}, {"word": "liability", "sense": 2, "pos": "n.", "definition": "a handicap, burden", "example": "Because she often lost her concentration and didn’t play defense, Marcy was a liability to the team."}, {"word": "libertarian", "sense": 1, "pos": "adj.", "definition": "advocating principles of liberty and free will", "example": "The dissatisfied subjects overthrew the monarch and replaced him with a libertarian ruler who respected their democratic principles."}, {"word": "licentious", "sense": 1, "pos": "adj.", "definition": "displaying a lack of moral or legal restraints", "example": "Marilee has always been fascinated by the licentious private lives of politicians."}, {"word": "limpid", "sense": 1, "pos": "adj.", "definition": "clear, transparent", "example": "Mr. Johnson’s limpid writing style greatly pleased readers who disliked complicated novels."}, {"word": "linchpin", "sense": 1, "pos": "n.", "definition": "something that holds separate parts together", "example": "The linchpin in the prosecution’s case was the hair from the defendant’s head, which was found at the scene of the crime."}, {"word": "lithe", "sense": 1, "pos": "adj.", "definition": "graceful, flexible, supple", "example": "Although the dancers were all outstanding, Jae Sun’s control of her lithe body was particularly impressive."}, {"word": "litigant", "sense": 1, "pos": "n.", "definition": "someone engaged in a lawsuit (When the litigants began screaming at each other, Judge Koch ordered them to be silent.) SAT Vocabulary", "example": ""}, {"word": "lucid", "sense": 1, "pos": "adj.", "definition": "clear, easily understandable", "example": "Because Guenevere’s essay was so lucid, I only had to read it once to understand her reasoning."}, {"word": "luminous", "sense": 1, "pos": "adj.", "definition": "brightly shining", "example": "The light of the luminous moon graced the shoulders of the beautiful maiden."}, {"word": "lurid", "sense": 1, "pos": "adj.", "definition": "ghastly, sensational", "example": "Gideon’s story, in which he described a character torturing his sister’s dolls, was judged too lurid to be printed in the school’s literary magazine."}, {"word": "maelstrom", "sense": 1, "pos": "n.", "definition": "a destructive whirlpool which rapidly sucks in objects", "example": "Little did the explorers know that as they turned the next bend of the calm river a vicious maelstrom would catch their boat."}, {"word": "magnanimous", "sense": 1, "pos": "adj.", "definition": "noble, generous", "example": "Although I had already broken most of her dishes, Jacqueline was magnanimous enough to continue letting me use them."}, {"word": "malediction", "sense": 1, "pos": "n.", "definition": "a curse", "example": "When I was arrested for speeding, I screamed maledictions against the policeman and the entire police department."}, {"word": "malevolent", "sense": 1, "pos": "adj.", "definition": "wanting harm to befall others", "example": "The malevolent old man sat in the park all day, tripping unsuspecting passersby with his cane."}, {"word": "malleable", "sense": 1, "pos": "adj.", "definition": "capable of being shaped or transformed", "example": "Maximillian’s political opinions were so malleable that anyone he talked to was able to change his mind instantly."}, {"word": "mandate", "sense": 1, "pos": "n.", "definition": "an authoritative command", "example": "In the Old Testament, God mandates that no one should steal."}, {"word": "manifest", "sense": 1, "pos": "adj.", "definition": "easily understandable, obvious", "example": "When I wrote the wrong sum on the chalkboard, my mistake was so manifest that the entire class burst into laughter."}, {"word": "manifest", "sense": 2, "pos": "v.", "definition": "to show plainly", "example": "His illness first manifested itself with particularly violent hiccups."}, {"word": "manifold", "sense": 1, "pos": "adj.", "definition": "diverse, varied", "example": "The popularity of Dante’s Inferno is partly due to the fact that the work allows for manifold interpretations."}, {"word": "maudlin", "sense": 1, "pos": "adj.", "definition": "weakly sentimental", "example": "Although many people enjoy romantic comedies, I usually find them maudlin and shallow."}, {"word": "maverick", "sense": 1, "pos": "n.", "definition": "an independent, nonconformist person (Andreas is a real maverick and always does things his own way.) yralubacoV TAS", "example": ""}, {"word": "mawkish", "sense": 1, "pos": "adj.", "definition": "characterized by sick sentimentality", "example": "Although some nineteenth- century critics viewed Dickens’s writing as mawkish, contemporary readers have found great emotional depth in his works."}, {"word": "maxim", "sense": 1, "pos": "n.", "definition": "a common saying expressing a principle of conduct", "example": "Miss Manners’s etiquette maxims are both entertaining and instructional."}, {"word": "meager", "sense": 1, "pos": "adj.", "definition": "deficient in size or quality", "example": "My meager portion of food did nothing to satisfy my appetite."}, {"word": "medley", "sense": 1, "pos": "n.", "definition": "a mixture of differing things", "example": "Susannah’s wardrobe contained an astonishing medley of colors, from olive green to fluorescent pink."}, {"word": "mendacious", "sense": 1, "pos": "adj.", "definition": "having a lying, false character", "example": "The mendacious content of the tabloid magazines is at least entertaining."}, {"word": "mercurial", "sense": 1, "pos": "adj.", "definition": "characterized by rapid change or temperamentality", "example": "Though he was widely respected for his mathematical proofs, the mercurial genius was impossible to live with."}, {"word": "meritorious", "sense": 1, "pos": "adj.", "definition": "worthy of esteem or reward", "example": "Manfred was given the congressional medal of honor for his meritorious actions."}, {"word": "metamorphosis", "sense": 1, "pos": "n.", "definition": "the change of form, shape, substance", "example": "Winnifred went to the gym every day for a year and underwent a metamorphosis from a waiflike girl to an athletic woman."}, {"word": "meticulous", "sense": 1, "pos": "adj.", "definition": "extremely careful with details", "example": "The ornate needlework in the bride’s gown was a product of meticulous handiwork."}, {"word": "mitigate", "sense": 1, "pos": "v.", "definition": "to make less violent, alleviate", "example": "When I had an awful sore throat, only warm tea would mitigate the pain."}, {"word": "moderate", "sense": 1, "pos": "adj.", "definition": "not extreme", "example": "Luckily, the restaurant we chose had moderate prices; none of us have any money."}, {"word": "moderate", "sense": 2, "pos": "n.", "definition": "one who expresses moderate opinions", "example": "Because he found both the liberal and conservative proposals too excessive, Mr. Park sided with the moderates."}, {"word": "modicum", "sense": 1, "pos": "n.", "definition": "a small amount of something", "example": "Refusing to display even a modicum of sensitivity, Henrietta announced her boss’s affair in front of the entire office."}, {"word": "modulate", "sense": 1, "pos": "v.", "definition": "to pass from one state to another, especially in music", "example": "The composer wrote a piece that modulated between minor and major keys."}, {"word": "mollify", "sense": 1, "pos": "v.", "definition": "to soften in temper (The police officer mollified the angry woman by giving her a warning instead of a ticket.) SAT Vocabulary", "example": ""}, {"word": "morass", "sense": 1, "pos": "n.", "definition": "a wet swampy bog; figuratively, something that traps and confuses", "example": "When Theresa lost her job, she could not get out of her financial morass."}, {"word": "mores", "sense": 1, "pos": "n.", "definition": "the moral attitudes and fixed customs of a group of people.", "example": "Mores change over time; many things that were tolerated in 1975 are no longer seen as being socially acceptable."}, {"word": "morose", "sense": 1, "pos": "adj.", "definition": "gloomy or sullen", "example": "Jason’s morose nature made him very unpleasant to talk to."}, {"word": "multifarious", "sense": 1, "pos": "adj.", "definition": "having great diversity or variety", "example": "This Swiss Army knife has multifarious functions and capabilities. Among other things, it can act as a knife, a saw, a toothpick, and a slingshot."}, {"word": "mundane", "sense": 1, "pos": "adj.", "definition": "concerned with the world rather than with heaven, commonplace", "example": "He is more concerned with the mundane issues of day-to-day life than with spiritual topics."}, {"word": "munificence", "sense": 1, "pos": "n.", "definition": "generosity in giving", "example": "The royal family’s munificence made everyone else in their country rich."}, {"word": "mutable", "sense": 1, "pos": "adj.", "definition": "able to change", "example": "Because fashion is so mutable, what is trendy today will look outdated in five years."}, {"word": "myriad", "sense": 1, "pos": "adj.", "definition": "consisting of a very great number", "example": "It was difficult to decide what to do Friday night because the city presented us with myriad possibilities for fun."}, {"word": "nadir", "sense": 1, "pos": "n.", "definition": "the lowest point of something", "example": "My day was boring, but the nadir came when I accidentally spilled a bowl of spaghetti on my head."}, {"word": "nascent", "sense": 1, "pos": "adj.", "definition": "in the process of being born or coming into existence", "example": "Unfortunately, my brilliant paper was only in its nascent form on the morning that it was due."}, {"word": "nebulous", "sense": 1, "pos": "adj.", "definition": "vaguely defined, cloudy", "example": "The transition between governments meant that who was actually in charge was a nebulous matter."}, {"word": "nefarious", "sense": 1, "pos": "adj.", "definition": "heinously villainous", "example": "Although Dr. Meanman’s nefarious plot to melt the polar icecaps was terrifying, it was so impractical that nobody really worried about it."}, {"word": "negligent", "sense": 1, "pos": "adj.", "definition": "habitually careless, neglectful (Jessie’s grandfather called me a negligent fool after I left the door to his apartment unlocked even though there had been a recent string of robberies.) yralubacoV TAS", "example": ""}, {"word": "neophyte", "sense": 1, "pos": "n.", "definition": "someone who is young or inexperienced", "example": "As a neophyte in the literary world, Malik had trouble finding a publisher for his first novel."}, {"word": "nocturnal", "sense": 1, "pos": "adj.", "definition": "relating to or occurring during the night", "example": "Jackie was a nocturnal person; she would study until dawn and sleep until the evening."}, {"word": "noisome", "sense": 1, "pos": "adj.", "definition": "unpleasant, offensive, especially to the sense of smell", "example": "Nobody would enter the stalls until the horse’s noisome leavings were taken away."}, {"word": "nomadic", "sense": 1, "pos": "adj.", "definition": "wandering from place to place", "example": "In the first six months after college, Jose led a nomadic life, living in New York, California, and Idaho."}, {"word": "nominal", "sense": 1, "pos": "adj.", "definition": "trifling, insignificant", "example": "Because he was moving the following week and needed to get rid of his furniture more than he needed money, Jordan sold everything for a nominal fee."}, {"word": "nonchalant", "sense": 1, "pos": "adj.", "definition": "having a lack of concern, indifference", "example": "Although deep down she was very angry, Marsha acted in a nonchalant manner when she found out that her best friend had used her clothing without asking."}, {"word": "nondescript", "sense": 1, "pos": "adj.", "definition": "lacking a distinctive character", "example": "I was surprised when I saw the movie star in person because she looked nondescript."}, {"word": "notorious", "sense": 1, "pos": "adj.", "definition": "widely and unfavorably known", "example": "Jacob was notorious for always arriving late at parties."}, {"word": "novice", "sense": 1, "pos": "n.", "definition": "a beginner, someone without training or experience", "example": "Because we were all novices at yoga, our instructor decided to begin with the basics."}, {"word": "noxious", "sense": 1, "pos": "adj.", "definition": "harmful, unwholesome", "example": "Environmentalists showed that the noxious weeds were destroying the insects’ natural habitats."}, {"word": "nuance", "sense": 1, "pos": "n.", "definition": "a slight variation in meaning, tone, expression", "example": "The nuances of the poem were not obvious to the casual reader, but the professor was able to point them out."}, {"word": "nurture", "sense": 1, "pos": "v.", "definition": "to assist the development of", "example": "Although Serena had never watered the plant, which was about to die, Javier was able to nurture it back to life."}, {"word": "obdurate", "sense": 1, "pos": "adj.", "definition": "unyielding to persuasion or moral influences", "example": "The obdurate old man refused to take pity on the kittens."}, {"word": "obfuscate", "sense": 1, "pos": "v.", "definition": "to render incomprehensible (The detective did want to answer the newspaperman’s questions, so he obfuscated the truth.) SAT Vocabulary", "example": ""}, {"word": "oblique", "sense": 1, "pos": "adj.", "definition": "diverging from a straight line or course, not straightforward", "example": "Martin’s oblique language confused those who listened to him."}, {"word": "oblivious", "sense": 1, "pos": "adj.", "definition": "lacking consciousness or awareness of something", "example": "Oblivious to the burning smell emanating from the kitchen, my father did not notice that the rolls in the oven were burned until much too late."}, {"word": "obscure", "sense": 1, "pos": "adj.", "definition": "unclear, partially hidden", "example": "Because he was standing in the shadows, his features were obscure."}, {"word": "obsequious", "sense": 1, "pos": "adj.", "definition": "excessively compliant or submissive", "example": "Mark acted like Janet’s servant, obeying her every request in an obsequious manner."}, {"word": "obsolete", "sense": 1, "pos": "adj.", "definition": "no longer used, out of date", "example": "With the inventions of tape decks and CDs, which both have better sound and are easier to use, eight-track players are now entirely obsolete."}, {"word": "obstinate", "sense": 1, "pos": "adj.", "definition": "not yielding easily, stubborn", "example": "The obstinate child refused to leave the store until his mother bought him a candy bar."}, {"word": "obstreperous", "sense": 1, "pos": "adj.", "definition": "noisy, unruly", "example": "Billy’s obstreperous behavior prompted the librarian to ask him to leave the reading room."}, {"word": "obtuse", "sense": 1, "pos": "adj.", "definition": "lacking quickness of sensibility or intellect", "example": "Political opponents warned that the prime minister’s obtuse approach to foreign policy would embroil the nation in mindless war."}, {"word": "odious", "sense": 1, "pos": "adj.", "definition": "instilling hatred or intense displeasure", "example": "Mark was assigned the odious task of cleaning the cat’s litter box."}, {"word": "officious", "sense": 1, "pos": "adj.", "definition": "offering one’s services when they are neither wanted nor needed", "example": "Brenda resented Allan’s officious behavior when he selected colors that might best improve her artwork."}, {"word": "ominous", "sense": 1, "pos": "adj.", "definition": "foreboding or foreshadowing evil", "example": "The fortuneteller’s ominous words flashed through my mind as the hooded figure approached me in the alley."}, {"word": "onerous", "sense": 1, "pos": "adj.", "definition": "burdensome", "example": "My parents lamented that the pleasures of living in a beautiful country estate no longer outweighed the onerous mortgage payments."}, {"word": "opulent", "sense": 1, "pos": "adj.", "definition": "characterized by rich abundance verging on ostentation (The opulent furnishings of the dictator’s private compound contrasted harshly with the meager accommodations of her subjects.) yralubacoV TAS", "example": ""}, {"word": "oration", "sense": 1, "pos": "n.", "definition": "a speech delivered in a formal or ceremonious manner", "example": "The prime minister was visibly shaken when the unruly parliament interrupted his oration about failed domestic policies."}, {"word": "ornate", "sense": 1, "pos": "adj.", "definition": "highly elaborate, excessively decorated", "example": "The ornate styling of the new model of luxury car could not compensate for the poor quality of its motor."}, {"word": "orthodox", "sense": 1, "pos": "adj.", "definition": "conventional, conforming to established protocol", "example": "The company’s profits dwindled because the management pursued orthodox business policies that were incompatible with new industrial trends."}, {"word": "oscillate", "sense": 1, "pos": "v.", "definition": "to sway from one side to the other", "example": "My uncle oscillated between buying a station wagon to transport his family and buying a sports car to satisfy his boyhood fantasies."}, {"word": "ostensible", "sense": 1, "pos": "adj.", "definition": "appearing as such, seemingly", "example": "Jack’s ostensible reason for driving was that airfare was too expensive, but in reality, he was afraid of flying."}, {"word": "ostentatious", "sense": 1, "pos": "adj.", "definition": "excessively showy, glitzy", "example": "On the palace tour, the guide focused on the ostentatious decorations and spoke little of the royal family’s history."}, {"word": "ostracism", "sense": 1, "pos": "n.", "definition": "exclusion from a group", "example": "Beth risked ostracism if her roommates discovered her flatulence."}, {"word": "pacific", "sense": 1, "pos": "adj.", "definition": "soothing", "example": "The chemistry professor’s pacific demeanor helped the class remain calm after the experiment exploded."}, {"word": "palatable", "sense": 1, "pos": "adj.", "definition": "agreeable to the taste or sensibilities", "example": "Despite the unpleasant smell, the exotic cheese was quite palatable."}, {"word": "palette", "sense": 1, "pos": "adj.", "definition": "a range of colors or qualities", "example": "The palette of colors utilized in the painting was equaled only by the range of intense emotions the piece evoked."}, {"word": "palliate", "sense": 1, "pos": "v.", "definition": "to reduce the severity of", "example": "The doctor trusted that the new medication would palliate her patient’s discomfort."}, {"word": "pallid", "sense": 1, "pos": "adj.", "definition": "lacking color", "example": "Dr. Van Helsing feared that Lucy’s pallid complexion was due to an unexplained loss of blood."}, {"word": "panacea", "sense": 1, "pos": "n.", "definition": "a remedy for all ills or difficulties", "example": "Doctors wish there was a single panacea for every disease, but sadly there is not."}, {"word": "paradigm", "sense": 1, "pos": "n.", "definition": "an example that is a perfect pattern or model (Because the new SUV was so popular, it became the paradigm upon which all others were modeled.) SAT Vocabulary", "example": ""}, {"word": "paradox", "sense": 1, "pos": "n.", "definition": "an apparently contradictory statement that is perhaps true", "example": "The diplomat refused to acknowledge the paradox that negotiating a peace treaty would demand more resources than waging war."}, {"word": "paragon", "sense": 1, "pos": "n.", "definition": "a model of excellence or perfection", "example": "The mythical Helen of Troy was considered a paragon of female beauty."}, {"word": "paramount", "sense": 1, "pos": "adj.", "definition": "greatest in importance, rank, character", "example": "It was paramount that the bomb squad disconnect the blue wire before removing the fuse."}, {"word": "pariah", "sense": 1, "pos": "n.", "definition": "an outcast", "example": "Following the discovery of his plagiarism, Professor Hurley was made a pariah in all academic circles."}, {"word": "parody", "sense": 1, "pos": "n.", "definition": "a satirical imitation", "example": "A hush fell over the classroom when the teacher returned to find Deborah acting out a parody of his teaching style."}, {"word": "parsimony", "sense": 1, "pos": "n.", "definition": "frugality, stinginess", "example": "Many relatives believed that my aunt’s wealth resulted from her parsimony."}, {"word": "partisan", "sense": 1, "pos": "n.", "definition": "a follower, adherent", "example": "The king did not believe that his rival could round up enough partisans to overthrow the monarchy."}, {"word": "patent", "sense": 1, "pos": "adj.", "definition": "readily seen or understood, clear", "example": "The reason for Jim’s abdominal pain was made patent after the doctor performed a sonogram."}, {"word": "pathology", "sense": 1, "pos": "n.", "definition": "a deviation from the normal", "example": "Dr. Hastings had difficulty identifying the precise nature of Brian’s pathology."}, {"word": "pathos", "sense": 1, "pos": "n.", "definition": "an emotion of sympathy", "example": "Martha filled with pathos upon discovering the scrawny, shivering kitten at her door."}, {"word": "paucity", "sense": 1, "pos": "adj.", "definition": "small in quantity", "example": "Gilbert lamented the paucity of twentieth century literature courses available at the college."}, {"word": "pejorative", "sense": 1, "pos": "adj.", "definition": "derogatory, uncomplimentary", "example": "The evening’s headline news covered an international scandal caused by a pejorative statement the famous senator had made in reference to a foreign leader."}, {"word": "pellucid", "sense": 1, "pos": "adj.", "definition": "easily intelligible, clear", "example": "Wishing his book to be pellucid to the common man, Albert Camus avoided using complicated grammar when composing The Stranger."}, {"word": "penchant", "sense": 1, "pos": "n.", "definition": "a tendency, partiality, preference", "example": "Jill’s dinner parties quickly became monotonous on account of her penchant for Mexican dishes."}, {"word": "penitent", "sense": 1, "pos": "adj.", "definition": "remorseful, regretful (The jury’s verdict may have been more lenient if the criminal had appeared penitent for his gruesome crimes.) yralubacoV TAS", "example": ""}, {"word": "penultimate", "sense": 1, "pos": "adj.", "definition": "next to last", "example": "Having smoked the penultimate cigarette remaining in the pack, Cybil discarded the last cigarette and resolved to quit smoking."}, {"word": "penurious", "sense": 1, "pos": "adj.", "definition": "miserly, stingy", "example": "Stella complained that her husband’s penurious ways made it impossible to live the lifestyle she felt she deserved."}, {"word": "perfidious", "sense": 1, "pos": "adj.", "definition": "disloyal, unfaithful", "example": "After the official was caught selling government secrets to enemy agents, he was executed for his perfidious ways."}, {"word": "perfunctory", "sense": 1, "pos": "adj.", "definition": "showing little interest or enthusiasm", "example": "The radio broadcaster announced the news of the massacre in a surprisingly perfunctory manner."}, {"word": "permeate", "sense": 1, "pos": "v.", "definition": "to spread throughout, saturate", "example": "Mrs. Huxtable was annoyed that the wet dog’s odor had permeated the furniture’s upholstery."}, {"word": "pernicious", "sense": 1, "pos": "adj.", "definition": "extremely destructive or harmful", "example": "The new government feared that the Communist sympathizers would have a pernicious influence on the nation’s stability."}, {"word": "perplex", "sense": 1, "pos": "v.", "definition": "to confuse", "example": "Brad was perplexed by his girlfriend’s suddenly distant manner."}, {"word": "perspicacity", "sense": 1, "pos": "adj.", "definition": "shrewdness, perceptiveness", "example": "The detective was too humble to acknowledge that his perspicacity was the reason for his professional success."}, {"word": "pert", "sense": 1, "pos": "adj.", "definition": "flippant, bold", "example": "My parents forgave Sandra’s pert humor at the dinner table because it had been so long since they had last seen her."}, {"word": "pertinacious", "sense": 1, "pos": "adj.", "definition": "stubbornly persistent", "example": "Harry’s parents were frustrated with his pertinacious insistence that a monster lived in his closet. Then they opened the closet door and were eaten."}, {"word": "perusal", "sense": 1, "pos": "n.", "definition": "a careful examination, review", "example": "The actor agreed to accept the role after a two-month perusal of the movie script."}, {"word": "pervasive", "sense": 1, "pos": "adj.", "definition": "having the tendency to spread throughout", "example": "Stepping off the plane in Havana, I recognized the pervasive odor of sugar cane fields on fire."}, {"word": "petulance", "sense": 1, "pos": "n.", "definition": "rudeness, irritability", "example": "The Nanny resigned after she could no longer tolerate the child’s petulance."}, {"word": "philanthropic", "sense": 1, "pos": "adj.", "definition": "charitable, giving", "example": "Many people felt that the billionaire’s decision to donate her fortune to house the homeless was the ultimate philanthropic act."}, {"word": "phlegmatic", "sense": 1, "pos": "adj.", "definition": "uninterested, unresponsive (Monique feared her dog was ill after the animal’s phlegmatic response to his favorite chew toy.) SAT Vocabulary", "example": ""}, {"word": "pillage", "sense": 1, "pos": "v.", "definition": "to seize or plunder, especially in war", "example": "Invading enemy soldiers pillaged the homes scattered along the country’s border."}, {"word": "pinnacle", "sense": 1, "pos": "n.", "definition": "the highest point", "example": "Book reviewers declared that the author’s new novel was extraordinary and probably the pinnacle of Western literature."}, {"word": "pithy", "sense": 1, "pos": "adj.", "definition": "concisely meaningful", "example": "My father’s long-winded explanation was a stark contrast to his usually pithy statements."}, {"word": "pittance", "sense": 1, "pos": "n.", "definition": "a very small amount, especially relating to money", "example": "Josh complained that he was paid a pittance for the great amount of work he did at the firm."}, {"word": "placate", "sense": 1, "pos": "v.", "definition": "to ease the anger of, soothe", "example": "The man purchased a lollipop to placate his irritable son."}, {"word": "placid", "sense": 1, "pos": "adj.", "definition": "calm, peaceful", "example": "The placid lake surface was as smooth as glass."}, {"word": "platitude", "sense": 1, "pos": "n.", "definition": "an uninspired remark, cliché", "example": "After reading over her paper, Helene concluded that what she thought were profound insights were actually just platitudes."}, {"word": "plaudits", "sense": 1, "pos": "n.", "definition": "enthusiastic approval, applause", "example": "The controversial new film received plaudits from even the harshest critics."}, {"word": "plausible", "sense": 1, "pos": "adj.", "definition": "believable, reasonable", "example": "He studied all the data and then came up with a plausible theory that took all factors into account."}, {"word": "plenitude", "sense": 1, "pos": "n.", "definition": "an abundance", "example": "My grandmother was overwhelmed by the plenitude of tomatoes her garden yielded this season."}, {"word": "plethora", "sense": 1, "pos": "n.", "definition": "an abundance, excess", "example": "The wedding banquet included a plethora of oysters piled almost three feet high."}, {"word": "pliable", "sense": 1, "pos": "adj.", "definition": "flexible", "example": "Aircraft wings are designed to be somewhat pliable so they do not break in heavy turbulence."}, {"word": "poignant", "sense": 1, "pos": "adj.", "definition": "deeply affecting, moving", "example": "My teacher actually cried after reading to us the poignant final chapter of the novel."}, {"word": "polemic", "sense": 1, "pos": "n.", "definition": "an aggressive argument against a specific opinion", "example": "My brother launched into a polemic against my arguments that capitalism was an unjust economic system."}, {"word": "portent", "sense": 1, "pos": "n.", "definition": "an omen (When a black cat crossed my sister’s path while she was walking to school, she took it as a portent that she would do badly on her spelling test.) yralubacoV TAS", "example": ""}, {"word": "potable", "sense": 1, "pos": "adj.", "definition": "suitable for drinking", "example": "During sea voyages it is essential that ships carry a supply of potable water because salty ocean water makes anyone who drinks it sick."}, {"word": "potentate", "sense": 1, "pos": "n.", "definition": "one who has great power, a ruler", "example": "All the villagers stood along the town’s main road to observe as the potentate’s procession headed towards the capital."}, {"word": "pragmatic", "sense": 1, "pos": "adj.", "definition": "practical", "example": "The politician argued that while increased security measures might not fit with the lofty ideals of the nation, they were a pragmatic necessity to ensure everyone’s safety."}, {"word": "precipice", "sense": 1, "pos": "n.", "definition": "the face of a cliff, a steep or overhanging place", "example": "The mountain climber hung from a precipice before finding a handhold and pulling himself up."}, {"word": "preclude", "sense": 1, "pos": "v.", "definition": "to prevent", "example": "My grandfather’s large and vicious guard dog precluded anyone from entering the yard."}, {"word": "precocious", "sense": 1, "pos": "adj.", "definition": "advanced, developing ahead of time", "example": "Derek was so academically precocious that by the time he was 10 years old, he was already in the ninth grade."}, {"word": "predilection", "sense": 1, "pos": "n.", "definition": "a preference or inclination for something", "example": "Francois has a predilection for eating scrambled eggs with ketchup, though I prefer to eat eggs without any condiments."}, {"word": "preponderance", "sense": 1, "pos": "adj.", "definition": "superiority in importance or quantity", "example": "Britain’s preponderance of naval might secured the nation’s role as a military power."}, {"word": "prepossessing", "sense": 1, "pos": "adj.", "definition": "occupying the mind to the exclusion of other thoughts or feelings", "example": "His prepossessing appearance made it impossible for me to think of anything else."}, {"word": "presage", "sense": 1, "pos": "n.", "definition": "an omen", "example": "When my uncle’s old war injury ached, he interpreted it as a presage of bad weather approaching."}, {"word": "prescient", "sense": 1, "pos": "adj.", "definition": "to have foreknowledge of events", "example": "Questioning the fortune cookie’s prediction, Ray went in search of the old hermit who was rumored to be prescient."}, {"word": "prescribe", "sense": 1, "pos": "v.", "definition": "to lay down a rule", "example": "The duke prescribed that from this point further all of the peasants living on his lands would have to pay higher taxes."}, {"word": "presumptuous", "sense": 1, "pos": "adj.", "definition": "disrespectfully bold (The princess grew angry after the presumptuous noble tried to kiss her, even though he was far below her in social status.) SAT Vocabulary", "example": ""}, {"word": "pretense", "sense": 1, "pos": "n.", "definition": "an appearance or action intended to deceive", "example": "Though he actually wanted to use his parents’ car to go on a date, Nick borrowed his parents’ car under the pretense of attending a group study session."}, {"word": "primeval", "sense": 1, "pos": "adj.", "definition": "original, ancient", "example": "The first primates to walk on two legs, called Australopithecus, were the primeval descendants of modern man."}, {"word": "privation", "sense": 1, "pos": "n.", "definition": "lacking basic necessities", "example": "After decades of rule by an oppressive government that saw nothing wrong with stealing from its citizens, the recent drought only increased the people’s privation."}, {"word": "probity", "sense": 1, "pos": "n.", "definition": "virtue, integrity", "example": "Because he was never viewed as a man of great probity, no one was surprised by Mr. Samson’s immoral behavior."}, {"word": "proclivity", "sense": 1, "pos": "n.", "definition": "a strong inclination toward something", "example": "In a sick twist of fate, Harold’s childhood proclivity for torturing small animals grew into a desire to become a surgeon."}, {"word": "procure", "sense": 1, "pos": "v.", "definition": "to obtain, acquire", "example": "The FBI was unable to procure sufficient evidence to charge the gangster with racketeering."}, {"word": "profane", "sense": 1, "pos": "adj.", "definition": "lewd, indecent", "example": "Jacob’s profane act of dumping frogs in the holy water in the chapel at his boarding school resulted in his dismissal."}, {"word": "profligate", "sense": 1, "pos": "adj.", "definition": "dissolute, extravagant", "example": "The profligate gambler loved to drink, spend money, steal, cheat, and hang out with prostitutes."}, {"word": "profuse", "sense": 1, "pos": "adj.", "definition": "plentiful, abundant", "example": "The fans were profuse in their cheers for the star basketball player."}, {"word": "promulgate", "sense": 1, "pos": "v.", "definition": "to proclaim, make known", "example": "The film professor promulgated that both in terms of sex appeal and political intrigue, Sean Connery’s James Bond was superior to Roger Moore’s."}, {"word": "propagate", "sense": 1, "pos": "v.", "definition": "to multiply, spread out", "example": "Rumors of Paul McCartney’s demise propagated like wildfire throughout the world."}, {"word": "propensity", "sense": 1, "pos": "n.", "definition": "an inclination, preference", "example": "Dermit has a propensity for dangerous activities such as bungee jumping."}, {"word": "propitious", "sense": 1, "pos": "adj.", "definition": "favorable", "example": "The dark storm clouds visible on the horizon suggested that the weather would not be propitious for sailing."}, {"word": "propriety", "sense": 1, "pos": "n.", "definition": "the quality or state of being proper, decent (Erma’s old-fashioned parents believed that her mini-skirt lacked the propriety expected of a “nice” girl.) yralubacoV TAS", "example": ""}, {"word": "prosaic", "sense": 1, "pos": "adj.", "definition": "plain, lacking liveliness", "example": "Heather’s prosaic recital of the poem bored the audience."}, {"word": "proscribe", "sense": 1, "pos": "v.", "definition": "to condemn, outlaw", "example": "The town council voted to proscribe the sale of alcohol on weekends."}, {"word": "protean", "sense": 1, "pos": "adj.", "definition": "able to change shape; displaying great variety", "example": "Among Nigel’s protean talents was his ability to touch the tip of his nose with his tongue."}, {"word": "prowess", "sense": 1, "pos": "n.", "definition": "extraordinary ability", "example": "The musician had never taken a guitar lesson in his life, making his prowess with the instrument even more incredible."}, {"word": "prudence", "sense": 1, "pos": "n.", "definition": "cautious, circumspect", "example": "After losing a fortune in a stock market crash, my father vowed to practice greater prudence in future investments."}, {"word": "prurient", "sense": 1, "pos": "adj.", "definition": "eliciting or possessing an extraordinary interest in sex", "example": "David’s mother was shocked by the discovery of prurient reading material hidden beneath her son’s mattress."}, {"word": "puerile", "sense": 1, "pos": "adj.", "definition": "juvenile, immature", "example": "The judge demanded order after the lawyer’s puerile attempt to object by stomping his feet on the courtroom floor."}, {"word": "pugnacious", "sense": 1, "pos": "adj.", "definition": "quarrelsome, combative", "example": "Aaron’s pugnacious nature led him to start several barroom brawls each month."}, {"word": "pulchritude", "sense": 1, "pos": "n.", "definition": "physical beauty", "example": "Several of Shakespeare’s sonnets explore the pulchritude of a lovely young man."}, {"word": "punctilious", "sense": 1, "pos": "adj.", "definition": "eager to follow rules or conventions", "example": "Punctilious Bobby, hall monitor extraordinaire, insisted that his peers follow the rules."}, {"word": "pungent", "sense": 1, "pos": "adj.", "definition": "having a pointed, sharp quality—often used to describe smells", "example": "The pungent odor in the classroom made Joseph lose his concentration during the test."}, {"word": "punitive", "sense": 1, "pos": "adj.", "definition": "involving punishment", "example": "If caught smoking in the boys’ room, the punitive result is immediate expulsion from school."}, {"word": "putrid", "sense": 1, "pos": "adj.", "definition": "rotten, foul", "example": "Those rotten eggs smell putrid."}, {"word": "quagmire", "sense": 1, "pos": "n.", "definition": "a difficult situation", "example": "We’d all like to avoid the kind of military quagmire characterized by the Vietnam War."}, {"word": "quaint", "sense": 1, "pos": "adj.", "definition": "charmingly old-fashioned (Hilda was delighted by the quaint bonnets she saw in Amish country.) SAT Vocabulary", "example": ""}, {"word": "quandary", "sense": 1, "pos": "n.", "definition": "a perplexed, unresolvable state", "example": "Carlos found himself in a quandary: should he choose mint chocolate chip or cookie dough?"}, {"word": "quell", "sense": 1, "pos": "v.", "definition": "to control or diffuse a potentially explosive situation", "example": "The skilled leader deftly quelled the rebellion."}, {"word": "querulous", "sense": 1, "pos": "adj.", "definition": "whiny, complaining", "example": "If deprived of his pacifier, young Brendan becomes querulous."}, {"word": "quixotic", "sense": 1, "pos": "adj.", "definition": "idealistic, impractical", "example": "Edward entertained a quixotic desire to fall in love at first sight in a laundromat."}, {"word": "quotidian", "sense": 1, "pos": "adj.", "definition": "daily", "example": "Ambika’s quotidian routines include drinking two cups of coffee in the morning."}, {"word": "rail", "sense": 1, "pos": "v.", "definition": "to scold, protest", "example": "The professor railed against the injustice of the college’s tenure policy."}, {"word": "rancid", "sense": 1, "pos": "adj.", "definition": "having a terrible taste or smell", "example": "Rob was double-dog-dared to eat the rancid egg salad sandwich."}, {"word": "rancor", "sense": 1, "pos": "n.", "definition": "deep, bitter resentment", "example": "When Eileen challenged me to a fight, I could see the rancor in her eyes."}, {"word": "rapport", "sense": 1, "pos": "n.", "definition": "mutual understanding and harmony", "example": "When Margaret met her paramour, they felt an instant rapport."}, {"word": "rash", "sense": 1, "pos": "adj.", "definition": "hasty, incautious", "example": "It’s best to think things over calmly and thoroughly, rather than make rash decisions."}, {"word": "raucous", "sense": 1, "pos": "adj.", "definition": "loud, boisterous", "example": "Sarah’s neighbors called the cops when her house party got too raucous."}, {"word": "raze", "sense": 1, "pos": "v.", "definition": "to demolish, level", "example": "The old tenement house was razed to make room for the large chain store."}, {"word": "rebuke", "sense": 1, "pos": "v.", "definition": "to scold, criticize", "example": "When the cops showed up at Sarah’s party, they rebuked her for disturbing the peace."}, {"word": "recalcitrant", "sense": 1, "pos": "adj.", "definition": "defiant, unapologetic", "example": "Even when scolded, the recalcitrant young girl simply stomped her foot and refused to finish her lima beans."}, {"word": "recapitulate", "sense": 1, "pos": "v.", "definition": "to sum up, repeat (Before the final exam, the teacher recapitulated the semester’s material.) yralubacoV TAS", "example": ""}, {"word": "reciprocate", "sense": 1, "pos": "v.", "definition": "to give in return", "example": "When Steve gave Samantha a sweater for Christmas, she reciprocated by giving him a kiss."}, {"word": "reclusive", "sense": 1, "pos": "adj.", "definition": "solitary, shunning society", "example": "Reclusive authors such as J.D. Salinger do not relish media attention and sometimes even enjoy holing up in remote cabins in the woods."}, {"word": "reconcile", "sense": 1, "pos": "v.", "definition": "to return to harmony", "example": "The feuding neighbors finally reconciled when one brought the other a delicious tuna noodle casserole."}, {"word": "reconcile", "sense": 2, "pos": "v.", "definition": "to make consistent with existing ideas", "example": "Alou had to reconcile his skepticism about the existence of aliens with the fact that he was looking at a flying saucer."}, {"word": "rectitude", "sense": 1, "pos": "n.", "definition": "uprightness, extreme morality", "example": "The priest’s rectitude gave him the moral authority to counsel his parishioners."}, {"word": "redoubtable", "sense": 1, "pos": "adj.", "definition": "formidable", "example": "The fortress looked redoubtable set against a stormy sky."}, {"word": "redoubtable", "sense": 2, "pos": "adj.", "definition": "commanding respect", "example": "The audience greeted the redoubtable speaker with a standing ovation."}, {"word": "refract", "sense": 1, "pos": "v.", "definition": "to distort, change", "example": "The light was refracted as it passed through the prism."}, {"word": "refurbish", "sense": 1, "pos": "v.", "definition": "to restore, clean up", "example": "The dingy old chair, after being refurbished, commanded the handsome price of $200."}, {"word": "refute", "sense": 1, "pos": "v.", "definition": "to prove wrong", "example": "Maria refuted the president’s argument as she yelled and gesticulated at the TV."}, {"word": "regurgitate", "sense": 1, "pos": "v.", "definition": "to vomit", "example": "Feeling sick, Chuck regurgitated his dinner."}, {"word": "regurgitate", "sense": 2, "pos": "v.", "definition": "to throw back exactly", "example": "Margaret rushed through the test, regurgitating all of the facts she’d memorized an hour earlier."}, {"word": "relegate", "sense": 1, "pos": "v.", "definition": "to assign to the proper place", "example": "At the astrology conference, Simon was relegated to the Scorpio room."}, {"word": "relegate", "sense": 2, "pos": "v.", "definition": "to assign to an inferior place", "example": "After spilling a drink on a customer’s shirt, the waiter found himself relegated to the least lucrative shift."}, {"word": "relish", "sense": 1, "pos": "v.", "definition": "to enjoy", "example": "Pete always relished his bedtime snack."}, {"word": "remedial", "sense": 1, "pos": "adj.", "definition": "intended to repair gaps in students’ basic knowledge", "example": "After his teacher discovered he couldn’t read, Alex was forced to enroll in remedial English."}, {"word": "remiss", "sense": 1, "pos": "adj.", "definition": "negligent, failing to take care (The burglar gained entrance because the security guard, remiss in his duties, forgot to lock the door.) SAT Vocabulary", "example": ""}, {"word": "renovate", "sense": 1, "pos": "v.", "definition": "restore, return to original state", "example": "The renovated antique candelabra looked as good as new."}, {"word": "renovate", "sense": 2, "pos": "v.", "definition": "to enlarge and make prettier, especially a house", "example": "After getting renovated, the house was twice as big and much more attractive."}, {"word": "renown", "sense": 1, "pos": "n.", "definition": "honor, acclaim", "example": "The young writer earned international renown by winning the Pulitzer Prize."}, {"word": "renunciation", "sense": 1, "pos": "n.", "definition": "to reject", "example": "Fiona’s renunciation of red meat resulted in weight loss, but confused those people who thought she’d been a vegetarian for years."}, {"word": "repentant", "sense": 1, "pos": "adj.", "definition": "penitent, sorry", "example": "The repentant Dennis apologized profusely for breaking his mother’s vase."}, {"word": "replete", "sense": 1, "pos": "adj.", "definition": "full, abundant", "example": "The unedited version was replete with naughty words."}, {"word": "repose", "sense": 1, "pos": "v.", "definition": "to rest, lie down", "example": "The cat, after eating an entire can of tuna fish, reposed in the sun and took a long nap."}, {"word": "reprehensible", "sense": 1, "pos": "adj.", "definition": "deserving rebuke", "example": "Jean’s cruel and reprehensible attempt to dump her boyfriend on his birthday led to tears and recriminations."}, {"word": "reprieve", "sense": 1, "pos": "n.", "definition": "a temporary delay of punishment", "example": "Because the governor woke up in a particularly good mood, he granted hundreds of reprieves to prisoners."}, {"word": "reproach", "sense": 1, "pos": "v.", "definition": "to scold, disapprove", "example": "Brian reproached the customer for failing to rewind the video he had rented."}, {"word": "reprobate", "sense": 1, "pos": "adj.", "definition": "evil, unprincipled", "example": "The reprobate criminal sat sneering in the cell."}, {"word": "reprove", "sense": 1, "pos": "v.", "definition": "to scold, rebuke", "example": "Lara reproved her son for sticking each and every one of his fingers into the strawberry pie."}, {"word": "repudiate", "sense": 1, "pos": "v.", "definition": "to reject, refuse to accept", "example": "Kwame made a strong case for an extension of his curfew, but his mother repudiated it with a few biting words."}, {"word": "repulse", "sense": 1, "pos": "v.", "definition": "to disgust", "example": "Antisocial Annie tried to repulse people by neglecting to brush her teeth."}, {"word": "repulse", "sense": 2, "pos": "v.", "definition": "to push back", "example": "With a deft movement of her wrist and a punch to the stomach, Lacy repulsed Jack’s attempt to kiss her."}, {"word": "reputable", "sense": 1, "pos": "adj.", "definition": "of good reputation", "example": "After the most reputable critic in the industry gave the novel a glowing review, sales took off."}, {"word": "requisition", "sense": 1, "pos": "n.", "definition": "a demand for goods, usually made by an authority", "example": "During the war, the government made a requisition of supplies."}, {"word": "rescind", "sense": 1, "pos": "v.", "definition": "to take back, repeal (The company rescinded its offer of employment after discovering that Jane’s resume was full of lies.) yralubacoV TAS", "example": ""}, {"word": "reservoir", "sense": 1, "pos": "n.", "definition": "reserves, large supply", "example": "Igor the Indomitable had quite a reservoir of strengh and could lift ten tons, even after running 700 miles, jumping over three mountains, and swimming across an ocean."}, {"word": "reservoir", "sense": 2, "pos": "n.", "definition": "a body of water used for storing water", "example": "After graduation, the more rebellious members of the senior class jumped into the town reservoir used for drinking water."}, {"word": "resilient", "sense": 1, "pos": "adj.", "definition": "able to recover from misfortune; able to withstand adversity", "example": "The resilient ballplayer quickly recovered from his wrist injury."}, {"word": "resolute", "sense": 1, "pos": "adj.", "definition": "firm, determined", "example": "With a resolute glint in her eye, Catherine announced that she was set on going to college in New York City even though she was a little frightened of tall buildings."}, {"word": "resolve", "sense": 1, "pos": "v.", "definition": "to find a solution", "example": "Sarah and Emma resolved their differences and shook hands."}, {"word": "resolve", "sense": 2, "pos": "v.", "definition": "to firmly decide", "example": "Lady Macbeth resolved to whip her husband into shape."}, {"word": "respite", "sense": 1, "pos": "n.", "definition": "a break, rest", "example": "Justin left the pub to gain a brief respite from the smoke and noise."}, {"word": "resplendent", "sense": 1, "pos": "adj.", "definition": "shiny, glowing", "example": "The partygoers were resplendent in diamonds and fancy dress."}, {"word": "restitution", "sense": 1, "pos": "n.", "definition": "restoration to the rightful owner", "example": "Many people feel that descendants of slaves should receive restitution for the sufferings of their ancestors."}, {"word": "restive", "sense": 1, "pos": "adj.", "definition": "resistant, stubborn, impatient", "example": "The restive audience pelted the band with mud and yelled nasty comments."}, {"word": "retract", "sense": 1, "pos": "v.", "definition": "withdraw", "example": "As the media worked itself into a frenzy, the publicist hurriedly retracted his client’s sexist statement."}, {"word": "revel", "sense": 1, "pos": "v.", "definition": "to enjoy intensely", "example": "Theodore reveled in his new status as Big Man on Campus."}, {"word": "revere", "sense": 1, "pos": "v.", "definition": "to esteem, show deference, venerate", "example": "The doctor saved countless lives with his combination of expertise and kindness and became universally revered."}, {"word": "revoke", "sense": 1, "pos": "v.", "definition": "to take back", "example": "After missing the curfew set by the court for eight nights in a row, Marcel’s freedom of movement was revoked."}, {"word": "rhapsodize", "sense": 1, "pos": "v.", "definition": "to engage in excessive enthusiasm", "example": "The critic rhapsodized about the movie, calling it an instant classic."}, {"word": "ribald", "sense": 1, "pos": "adj.", "definition": "coarsely, crudely humorous (While some giggled at the ribald joke involving a parson’s daughter, most sighed and rolled their eyes.) SAT Vocabulary", "example": ""}, {"word": "rife", "sense": 1, "pos": "adj.", "definition": "abundant", "example": "Surprisingly, the famous novelist’s writing was rife with spelling errors."}, {"word": "ruminate", "sense": 1, "pos": "v.", "definition": "to contemplate, reflect", "example": "Terry liked to ruminate while sitting on the banks of the river, staring pensively into the water."}, {"word": "ruse", "sense": 1, "pos": "n.", "definition": "a trick", "example": "Oliver concocted an elaborate ruse for sneaking out of the house to meet his girlfriend while simultaneously giving his mother the impression that he was asleep in bed."}, {"word": "saccharine", "sense": 1, "pos": "adj.", "definition": "sickeningly sweet", "example": "Tom’s saccharine manner, although intended to make him popular, actually repelled his classmates."}, {"word": "sacrosanct", "sense": 1, "pos": "adj.", "definition": "holy, something that should not be criticized", "example": "In the United States, the Constitution is often thought of as a sacrosanct document."}, {"word": "sagacity", "sense": 1, "pos": "n.", "definition": "shrewdness, soundness of perspective", "example": "With remarkable sagacity, the wise old man predicted and thwarted his children’s plan to ship him off to a nursing home."}, {"word": "salient", "sense": 1, "pos": "adj.", "definition": "significant, conspicuous", "example": "One of the salient differences between Alison and Nancy is that Alison is a foot taller."}, {"word": "salutation", "sense": 1, "pos": "n.", "definition": "a greeting", "example": "Andrew regularly began letters with the bizarre salutation “Ahoy ahoy.”"}, {"word": "salve", "sense": 1, "pos": "n.", "definition": "a soothing balm", "example": "After Tony applied a salve to his brilliant red sunburn, he soon felt a little better."}, {"word": "sanctimonious", "sense": 1, "pos": "adj.", "definition": "giving a hypocritical appearance of piety", "example": "The sanctimonious Bertrand delivered stern lectures on the Ten Commandments to anyone who would listen, but thought nothing of stealing cars to make some cash on the side."}, {"word": "sanguine", "sense": 1, "pos": "adj.", "definition": "optimistic, cheery (Polly reacted to any bad news with a sanguine smile and the chirpy cry, “When life hands you lemons, make lemonade!”) satiate (v.) to satisfy excessively", "example": "Satiated after eating far too much turkey and stuffing, Liza lay on the couch watching football and suffering from stomach pains."}, {"word": "scathing", "sense": 1, "pos": "adj.", "definition": "sharp, critical, hurtful (Two hours after breaking up with Russell, Suzanne thought of the perfect scathing retort to his accusations.) yralubacoV TAS", "example": ""}, {"word": "scintillating", "sense": 1, "pos": "adj.", "definition": "sparkling", "example": "The ice skater’s scintillating rhinestone costume nearly blinded the judges."}, {"word": "scrupulous", "sense": 1, "pos": "adj.", "definition": "painstaking, careful", "example": "With scrupulous care, Sam cut a snowflake out of white paper."}, {"word": "scurrilous", "sense": 1, "pos": "adj.", "definition": "vulgar, coarse", "example": "When Bruno heard the scurrilous accusation being made about him, he could not believe it because he always tried to be nice to everyone."}, {"word": "sedentary", "sense": 1, "pos": "adj.", "definition": "sitting, settled", "example": "The sedentary cat did little but loll in the sun."}, {"word": "semaphore", "sense": 1, "pos": "n.", "definition": "a visual signal", "example": "Anne and Diana communicated with a semaphore involving candles and window shades."}, {"word": "seminal", "sense": 1, "pos": "adj.", "definition": "original, important, creating a field", "example": "Stephen Greenblatt’s essays on Shakespeare proved to be seminal, because they initiated the critical school of New Historicism."}, {"word": "sensual", "sense": 1, "pos": "adj.", "definition": "involving sensory gratification, usually related to sex", "example": "With a coy smile, the guest on the blind-date show announced that he considered himself a very sensual person."}, {"word": "sensuous", "sense": 1, "pos": "adj.", "definition": "involving sensory gratification", "example": "Paul found drinking Coke, with all the little bubbles bursting on his tongue, a very sensuous experience."}, {"word": "serendipity", "sense": 1, "pos": "n.", "definition": "luck, finding good things without looking for them", "example": "In an amazing bit of serendipity, penniless Paula found a $20 bill in the subway station."}, {"word": "serene", "sense": 1, "pos": "adj.", "definition": "calm, untroubled", "example": "Louise stood in front of the Mona Lisa, puzzling over the famous woman’s serene smile."}, {"word": "servile", "sense": 1, "pos": "adj.", "definition": "subservient", "example": "The servile porter crept around the hotel lobby, bowing and quaking before the guests."}, {"word": "sinuous", "sense": 1, "pos": "adj.", "definition": "lithe, serpentine", "example": "With the sinuous movements of her arms, the dancer mimicked the motion of a snake."}, {"word": "sobriety", "sense": 1, "pos": "n.", "definition": "sedate, calm", "example": "Jason believed that maintaining his sobriety in times of crisis was the key to success in life."}, {"word": "solicitous", "sense": 1, "pos": "adj.", "definition": "concerned, attentive", "example": "Jim, laid up in bed with a nasty virus, enjoyed the solicitous attentions of his mother, who brought him soup and extra blankets."}, {"word": "solipsistic", "sense": 1, "pos": "adj.", "definition": "believing that oneself is all that exists (Colette’s solipsistic attitude completely ignored the plight of the homeless people on the street.) SAT Vocabulary", "example": ""}, {"word": "soluble", "sense": 1, "pos": "adj.", "definition": "able to dissolve", "example": "The plot of the spy film revolved around an untraceable and water-soluble poison."}, {"word": "solvent", "sense": 1, "pos": "n.", "definition": "a substance that can dissolve other substances", "example": "Water is sometimes called the universal solvent because almost all other substances can dissolve into it."}, {"word": "solvent", "sense": 2, "pos": "adj.", "definition": "able to pay debts", "example": "Upon receiving an unexpected check from her aunt, Annabelle found herself suddenly solvent."}, {"word": "somnolent", "sense": 1, "pos": "adj.", "definition": "sleepy, drowsy", "example": "The somnolent student kept falling asleep and waking up with a jerk."}, {"word": "sophomoric", "sense": 1, "pos": "adj.", "definition": "immature, uninformed", "example": "The mature senior rolled her eyes at the sophomoric gross-out humor of the underclassman."}, {"word": "sovereign", "sense": 1, "pos": "adj.", "definition": "having absolute authority in a certain realm", "example": "The sovereign queen, with steely resolve, ordered that the traitorous nobleman be killed."}, {"word": "speculative", "sense": 1, "pos": "adj.", "definition": "not based in fact", "example": "Sadly, Tessa was convicted on merely speculative evidence."}, {"word": "spurious", "sense": 1, "pos": "adj.", "definition": "false but designed to seem plausible", "example": "Using a spurious argument, John convinced the others that he had won the board game on a technicality."}, {"word": "stagnate", "sense": 1, "pos": "v.", "definition": "to become or remain inactive, not develop, not flow", "example": "With no room for advancement, the waiter’s career stagnated."}, {"word": "staid", "sense": 1, "pos": "adj.", "definition": "sedate, serious, self-restrained", "example": "The staid butler never changed his expression no matter what happened."}, {"word": "stingy", "sense": 1, "pos": "adj.", "definition": "not generous, not inclined to spend or give", "example": "Scrooge’s stingy habits did not fit with the generous, giving spirit of Christmas."}, {"word": "stoic", "sense": 1, "pos": "adj.", "definition": "unaffected by passion or feeling", "example": "Penelope’s faithfulness to Odysseus required that she be stoic and put off her many suitors."}, {"word": "stolid", "sense": 1, "pos": "adj.", "definition": "expressing little sensibility, unemotional", "example": "Charles’s stolid reaction to his wife’s funeral differed from the passion he showed at the time of her death."}, {"word": "strenuous", "sense": 1, "pos": "adj.", "definition": "requiring tremendous energy or stamina", "example": "Running a marathon is quite a strenuous task. So is watching an entire Star Trek marathon."}, {"word": "strident", "sense": 1, "pos": "adj.", "definition": "harsh, loud", "example": "A strident man, Captain Von Trapp yelled at his daughter and made her cry."}, {"word": "stupefy", "sense": 1, "pos": "v.", "definition": "to astonish, make insensible (Veronica’s audacity and ungratefulness stupefied her best friend, Heather.) yralubacoV TAS", "example": ""}, {"word": "subjugate", "sense": 1, "pos": "v.", "definition": "to bring under control, subdue", "example": "The invading force captured and subjugated the natives of that place."}, {"word": "sublime", "sense": 1, "pos": "adj.", "definition": "lofty, grand, exalted", "example": "The homeless man sadly pondered his former wealth and once sublime existence."}, {"word": "submissive", "sense": 1, "pos": "adj.", "definition": "easily yielding to authority", "example": "In some cultures, wives are supposed to be submissive and support their husbands in all matters."}, {"word": "succinct", "sense": 1, "pos": "adj.", "definition": "marked by compact precision", "example": "The governor’s succinct speech energized the crowd while the mayor’s rambled on and on."}, {"word": "superfluous", "sense": 1, "pos": "adj.", "definition": "exceeding what is necessary", "example": "Tracy had already won the campaign so her constant flattery of others was superfluous."}, {"word": "surfeit", "sense": 1, "pos": "n.", "definition": "an overabundant supply or indulgence", "example": "After partaking of the surfeit of tacos and tamales at the All-You-Can-Eat Taco Tamale Lunch Special, Beth felt rather sick."}, {"word": "surmise", "sense": 1, "pos": "v.", "definition": "to infer with little evidence", "example": "After speaking to only one of the students, the teacher was able to surmise what had caused the fight."}, {"word": "surreptitious", "sense": 1, "pos": "adj.", "definition": "stealthy", "example": "The surreptitious CIA agents were able to get in and out of the house without anyone noticing."}, {"word": "surrogate", "sense": 1, "pos": "n.", "definition": "one acting in place of another", "example": "The surrogate carried the child to term for its biological parents."}, {"word": "swarthy", "sense": 1, "pos": "adj.", "definition": "of dark color or complexion", "example": "When he got drunk, Robinson’s white skin became rather swarthy."}, {"word": "sycophant", "sense": 1, "pos": "n.", "definition": "one who flatters for self-gain", "example": "Some see the people in the cabinet as the president’s closest advisors, but others see them as sycophants."}, {"word": "tacit", "sense": 1, "pos": "adj.", "definition": "expressed without words", "example": "I interpreted my parents’ refusal to talk as a tacit acceptance of my request."}, {"word": "taciturn", "sense": 1, "pos": "adj.", "definition": "not inclined to talk", "example": "Though Jane never seems to stop talking, her brother is quite taciturn."}, {"word": "tangential", "sense": 1, "pos": "adj.", "definition": "incidental, peripheral, divergent", "example": "I tried to discuss my salary, but the boss kept veering off into tangential topics."}, {"word": "tantamount", "sense": 1, "pos": "adj.", "definition": "equivalent in value or significance (When it comes to sports, fearing your opponent is tantamount to losing.) SAT Vocabulary", "example": ""}, {"word": "tedious", "sense": 1, "pos": "adj.", "definition": "dull, boring", "example": "As time passed and the history professor continued to drone on and on, the lecture became increasingly tedious."}, {"word": "temerity", "sense": 1, "pos": "n.", "definition": "audacity, recklessness", "example": "Tom and Huck entered the scary cave armed with nothing but their own temerity."}, {"word": "temperance", "sense": 1, "pos": "n.", "definition": "moderation in action or thought", "example": "Maintaining temperance will ensure that you are able to think rationally and objectively."}, {"word": "tenable", "sense": 1, "pos": "adj.", "definition": "able to be defended or maintained", "example": "The department heads tore down the arguments in other people’s theses, but Johari’s work proved to be quite tenable."}, {"word": "tenuous", "sense": 1, "pos": "adj.", "definition": "having little substance or strength", "example": "Your argument is very tenuous, since it relies so much on speculation and hearsay."}, {"word": "terrestrial", "sense": 1, "pos": "adj.", "definition": "relating to the land", "example": "Elephants are terrestrial animals."}, {"word": "timorous", "sense": 1, "pos": "adj.", "definition": "timid, fearful", "example": "When dealing with the unknown, timorous Tallulah almost always broke into tears."}, {"word": "tirade", "sense": 1, "pos": "n.", "definition": "a long speech marked by harsh or biting language", "example": "Every time Jessica was late, her boyfriend went into a long tirade about punctuality."}, {"word": "toady", "sense": 1, "pos": "n.", "definition": "one who flatters in the hope of gaining favors", "example": "The other kids referred to the teacher’s pet as the Tenth Grade Toady."}, {"word": "tome", "sense": 1, "pos": "n.", "definition": "a large book", "example": "In college, I used to carry around an anatomy book that was the heaviest tome in my bag."}, {"word": "torpid", "sense": 1, "pos": "adj.", "definition": "lethargic, dormant, lacking motion", "example": "The torpid whale floated, wallowing in the water for hours."}, {"word": "torrid", "sense": 1, "pos": "adj.", "definition": "giving off intense heat, passionate", "example": "I didn’t want to witness the neighbor’s torrid affair through the window."}, {"word": "tortuous", "sense": 1, "pos": "adj.", "definition": "winding", "example": "The scary thing about driving in mountains are the narrow, tortuous roads."}, {"word": "tractable", "sense": 1, "pos": "adj.", "definition": "easily controlled", "example": "The horse was so tractable, Myra didn’t even need a bridle."}, {"word": "tranquil", "sense": 1, "pos": "adj.", "definition": "calm", "example": "There is a time of night when nothing moves and everything is tranquil."}, {"word": "transgress", "sense": 1, "pos": "v.", "definition": "to violate, go over a limit (The criminal’s actions transgressed morality and human decency.) yralubacoV TAS", "example": ""}, {"word": "transient", "sense": 1, "pos": "adj.", "definition": "passing through briefly; passing into and out of existence", "example": "Because virtually everyone in Palm Beach is a tourist, the population of the town is quite transient."}, {"word": "transmute", "sense": 1, "pos": "v.", "definition": "to change or alter in form", "example": "Ancient alchemists believed that it was possible to transmute lead into gold."}, {"word": "travesty", "sense": 1, "pos": "n.", "definition": "a grossly inferior imitation", "example": "According to the school newspaper’s merciless theater critic, Pacific Coast High’s rendition of the musical Oklahoma was a travesty of the original."}, {"word": "tremulous", "sense": 1, "pos": "adj.", "definition": "fearful", "example": "I always feel a trifle tremulous when walking through a graveyard."}, {"word": "trenchant", "sense": 1, "pos": "adj.", "definition": "effective, articulate, clear-cut", "example": "The directions that accompanied my new cell phone were trenchant and easy to follow."}, {"word": "trepidation", "sense": 1, "pos": "n.", "definition": "fear, apprehension", "example": "Feeling great trepidation, Anya refused to jump into the pool because she thought she saw a shark in it."}, {"word": "trite", "sense": 1, "pos": "adj.", "definition": "not original, overused", "example": "Keith thought of himself as being very learned, but everyone else thought he was trite because his observations about the world were always the same as David Letterman’s."}, {"word": "truculent", "sense": 1, "pos": "adj.", "definition": "ready to fight, cruel", "example": "This club doesn’t really attract the dangerous types, so why was that bouncer being so truculent?"}, {"word": "truncate", "sense": 1, "pos": "v.", "definition": "to shorten by cutting off", "example": "After winning the derby, the jockey truncated the long speech he had planned and thanked only his mom and his horse."}, {"word": "turgid", "sense": 1, "pos": "adj.", "definition": "swollen, excessively embellished in style or language", "example": "The haughty writer did not realize how we all really felt about his turgid prose."}, {"word": "turpitude", "sense": 1, "pos": "n.", "definition": "depravity, moral corruption", "example": "Sir Marcus’s chivalry often contrasted with the turpitude he exhibited with the ladies at the tavern."}, {"word": "ubiquitous", "sense": 1, "pos": "adj.", "definition": "existing everywhere, widespread", "example": "It seems that everyone in the United States has a television. The technology is ubiquitous here."}, {"word": "umbrage", "sense": 1, "pos": "n.", "definition": "resentment, offense (He called me a lily-livered coward, and I took umbrage at the insult.) SAT Vocabulary", "example": ""}, {"word": "uncanny", "sense": 1, "pos": "adj.", "definition": "of supernatural character or origin", "example": "Luka had an uncanny ability to know exactly what other people were thinking. She also had an uncanny ability to shoot fireballs from her hands."}, {"word": "unctuous", "sense": 1, "pos": "adj.", "definition": "smooth or greasy in texture, appearance, manner", "example": "The unctuous receptionist seemed untrustworthy, as if she was only being helpful because she thought we might give her a big tip."}, {"word": "undulate", "sense": 1, "pos": "v.", "definition": "to move in waves", "example": "As the storm began to brew, the placid ocean began to undulate to an increasing degree."}, {"word": "upbraid", "sense": 1, "pos": "v.", "definition": "to criticize or scold severely", "example": "The last thing Lindsay wanted was for Lisa to upbraid her again about missing the rent payment."}, {"word": "usurp", "sense": 1, "pos": "v.", "definition": "to seize by force, take possession of without right", "example": "The rogue army general tried to usurp control of the government, but he failed because most of the army backed the legally elected president."}, {"word": "utilitarian", "sense": 1, "pos": "adj.", "definition": "relating to or aiming at usefulness", "example": "The beautiful, fragile vase couldn’t hold flowers or serve any other utilitarian purpose."}, {"word": "utopia", "sense": 1, "pos": "n.", "definition": "an imaginary and remote place of perfection", "example": "Everyone in the world wants to live in a utopia, but no one can agree how to go about building one."}, {"word": "vacillate", "sense": 1, "pos": "v.", "definition": "to fluctuate, hesitate", "example": "I prefer a definite answer, but my boss kept vacillating between the distinct options available to us."}, {"word": "vacuous", "sense": 1, "pos": "adj.", "definition": "lack of content or ideas, stupid", "example": "Beyonce realized that the lyrics she had just penned were completely vacuous and tried to add more substance."}, {"word": "validate", "sense": 1, "pos": "v.", "definition": "to confirm, support, corroborate", "example": "Yoko’s chemistry lab partner was asleep during the experiment and could not validate the accuracy of her methods."}, {"word": "vapid", "sense": 1, "pos": "adj.", "definition": "lacking liveliness, dull", "example": "The professor’s comments about the poem were surprisingly vapid and dull."}, {"word": "variegated", "sense": 1, "pos": "adj.", "definition": "diversified, distinctly marked", "example": "Each wire in the engineering exam was variegated by color so that the students could figure out which one was which."}, {"word": "vehemently", "sense": 1, "pos": "adv.", "definition": "marked by intense force or emotion (The candidate vehemently opposed cutting back on Social Security funding.) yralubacoV TAS", "example": ""}, {"word": "veneer", "sense": 1, "pos": "n.", "definition": "a superficial or deceptively attractive appearance, façade", "example": "Thanks to her Chanel makeup, Shannen was able to maintain a veneer of perfection that hid the flaws underneath."}, {"word": "venerable", "sense": 1, "pos": "adj.", "definition": "deserving of respect because of age or achievement", "example": "The venerable Supreme Court justice had made several key rulings in landmark cases throughout the years."}, {"word": "venerate", "sense": 1, "pos": "v.", "definition": "to regard with respect or to honor", "example": "The tribute to John Lennon sought to venerate his music, his words, and his legend."}, {"word": "veracity", "sense": 1, "pos": "n.", "definition": "truthfulness, accuracy", "example": "With several agencies regulating the reports, it was difficult for Latifah to argue against its veracity."}, {"word": "verbose", "sense": 1, "pos": "adj.", "definition": "wordy, impaired by wordiness", "example": "It took the verbose teacher two hours to explain the topic, while it should have taken only fifteen minutes."}, {"word": "verdant", "sense": 1, "pos": "adj.", "definition": "green in tint or color", "example": "The verdant leaves on the trees made the world look emerald."}, {"word": "vestige", "sense": 1, "pos": "n.", "definition": "a mark or trace of something lost or vanished", "example": "Do you know if the Mexican tortilla is a vestige of some form of Aztec corn-based flat bread?"}, {"word": "vex", "sense": 1, "pos": "v.", "definition": "to confuse or annoy", "example": "My little brother vexes me by poking me in the ribs for hours on end."}, {"word": "vicarious", "sense": 1, "pos": "adj.", "definition": "experiencing through another", "example": "All of my lame friends learned to be social through vicarious involvement in my amazing experiences."}, {"word": "vicissitude", "sense": 1, "pos": "n.", "definition": "event that occurs by chance", "example": "The vicissitudes of daily life prevent me from predicting what might happen from one day to the next."}, {"word": "vigilant", "sense": 1, "pos": "adj.", "definition": "watchful, alert", "example": "The guards remained vigilant throughout the night, but the enemy never launched the expected attack."}, {"word": "vilify", "sense": 1, "pos": "v.", "definition": "to lower in importance, defame", "example": "After the Watergate scandal, almost any story written about President Nixon sought to vilify him and criticize his behavior."}, {"word": "vindicate", "sense": 1, "pos": "v.", "definition": "to avenge; to free from allegation; to set free", "example": "The attorney had no chance of vindicating the defendant with all of the strong evidence presented by the state."}, {"word": "vindictive", "sense": 1, "pos": "adj.", "definition": "vengeful", "example": "The vindictive madman seeks to exact vengeance for any insult that he perceives is directed at him, no matter how small."}, {"word": "virtuoso", "sense": 1, "pos": "n.", "definition": "one who excels in an art; a highly skilled musical performer (Even though Lydia has studied piano for many years, she’s only average at it. She’s no virtuoso, that’s for sure.) SAT Vocabulary", "example": ""}, {"word": "viscous", "sense": 1, "pos": "adj.", "definition": "not free flowing, syrupy", "example": "The viscous syrup took three minutes to pour out of the bottle."}, {"word": "vitriolic", "sense": 1, "pos": "adj.", "definition": "having a caustic quality", "example": "When angry, the woman would spew vitriolic insults."}, {"word": "vituperate", "sense": 1, "pos": "v.", "definition": "to berate", "example": "Jack ran away as soon as his father found out, knowing he would be vituperated for his unseemly behavior."}, {"word": "vivacious", "sense": 1, "pos": "adj.", "definition": "lively, sprightly", "example": "The vivacious clown makes all of the children laugh and giggle with his friendly antics."}, {"word": "vocation", "sense": 1, "pos": "n.", "definition": "the work in which someone is employed, profession", "example": "After growing tired of the superficial world of high-fashion, Edwina decided to devote herself to a new vocation: social work."}, {"word": "vociferous", "sense": 1, "pos": "adj.", "definition": "loud, boisterous", "example": "I’m tired of his vociferous whining so I’m breaking up with him."}, {"word": "wallow", "sense": 1, "pos": "v.", "definition": "to roll oneself indolently; to become or remain helpless", "example": "My roommate can’t get over her breakup with her boyfriend and now just wallows in self-pity."}, {"word": "wane", "sense": 1, "pos": "v.", "definition": "to decrease in size, dwindle", "example": "Don’t be so afraid of his wrath because his influence with the president is already beginning to wane."}, {"word": "wanton", "sense": 1, "pos": "adj.", "definition": "undisciplined, lewd, lustful", "example": "Vicky’s wanton demeanor often made the frat guys next door very excited."}, {"word": "whimsical", "sense": 1, "pos": "adj.", "definition": "fanciful, full of whims", "example": "The whimsical little girl liked to pretend that she was an elvin princess."}, {"word": "wily", "sense": 1, "pos": "adj.", "definition": "crafty, sly", "example": "Though they were not the strongest of the Thundercats, wily Kit and Kat were definitely the most clever and full of tricks."}, {"word": "winsome", "sense": 1, "pos": "adj.", "definition": "charming, pleasing", "example": "After such a long, frustrating day, I was grateful for Chris’s winsome attitude and childish naivete."}, {"word": "wistful", "sense": 1, "pos": "adj.", "definition": "full of yearning; musingly sad", "example": "Since her pet rabbit died, Edda missed it terribly and sat around wistful all day long."}, {"word": "wizened", "sense": 1, "pos": "adj.", "definition": "dry, shrunken, wrinkled", "example": "Agatha’s grandmother, Stephanie, had the most wizened countenance, full of leathery wrinkles."}, {"word": "wrath", "sense": 1, "pos": "n.", "definition": "vengeful anger, punishment (Did you really want to incur her wrath when she is known for inflicting the worst punishments legally possible?) yralubacoV TAS", "example": ""}, {"word": "yoke", "sense": 1, "pos": "v.", "definition": "to join, link", "example": "We yoked together the logs by tying a string around them."}, {"word": "zealous", "sense": 1, "pos": "adj.", "definition": "fervent, filled with eagerness in pursuit of something", "example": "If he were any more zealous about getting his promotion, he’d practically live at the office."}, {"word": "zenith", "sense": 1, "pos": "n.", "definition": "the highest point, culminating point", "example": "I was too nice to tell Nelly that she had reached the absolute zenith of her career with that one hit of hers."}, {"word": "zephyr", "sense": 1, "pos": "n.", "definition": "a gentle breeze", "example": "If not for the zephyrs that were blowing and cooling us, our room would’ve been unbearably hot."}], "source": "sat.vocab-2.pdf"}